<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="10"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		 description:  ['增强经济发展的可持续性和竞争力', '朔黄铁路：与环境和社会共同发展', '司法警察队伍要向知识化正规化专业化方向发展'],
		 frequency:  [1260, 228, 3616, 8240, 9422, 1598, 4514, 9872, 22528, 25846, 18006],
		 word:'发展',
		 index:9
	   },
      clickedWord: '',
	words2 :[
		{'text': '发展', 'size': 12847},{'text': '胡锦涛', 'size': 5253},{'text': '企业', 'size': 3519},{'text': '奥运', 'size': 3320},{'text': '创新', 'size': 3268},{'text': '服务', 'size': 3263},{'text': '安全', 'size': 2667},{'text': '和谐', 'size': 2082},{'text': '贾庆林', 'size': 1893},{'text': '农民工', 'size': 1849},{'text': '科学发展', 'size': 1834},{'text': '科技', 'size': 1770},{'text': '欧盟', 'size': 1725},{'text': '民生', 'size': 1594},{'text': '非典', 'size': 1587},{'text': '健康', 'size': 1559},{'text': '人才', 'size': 1548},{'text': '科学发展观', 'size': 899},{'text': '均衡', 'size': 150},{'text': '全方位', 'size': 148},{'text': '健康成长', 'size': 144},{'text': '自主创新能力', 'size': 144},{'text': '走向世界', 'size': 140},{'text': '贯彻落实科学发展观', 'size': 140},{'text': '生态环境', 'size': 130},{'text': '坚持以人为本', 'size': 130},{'text': '绿色发展', 'size': 130},{'text': '全球经济', 'size': 126},{'text': '一个中国', 'size': 122},{'text': '文化体制改革', 'size': 117},{'text': '火炬传递', 'size': 117},{'text': '理论创新', 'size': 112},{'text': '持续发展', 'size': 110},{'text': '和谐文化', 'size': 110},{'text': '农民致富', 'size': 108},{'text': '发展道路', 'size': 106},{'text': '生产力', 'size': 104},{'text': '城乡统筹', 'size': 104},{'text': '软实力', 'size': 104},{'text': '中国体育代表团', 'size': 104},{'text': '全面小康', 'size': 98},{'text': '核心竞争力', 'size': 98},{'text': '精神文明建设', 'size': 98},{'text': '经济转型', 'size': 98},{'text': '北京残奥会', 'size': 98}
		],
      wordData: [
		{'word': '发展', 'descriptions': ['增强经济发展的可持续性和竞争力', '朔黄铁路：与环境和社会共同发展', '司法警察队伍要向知识化正规化专业化方向发展'], 'frequency': [1260, 228, 3616, 8240, 9422, 1598, 4514, 9872, 22528, 25846, 18006]},
		{'word': '胡锦涛', 'descriptions': ['胡锦涛同布莱尔举行会谈', '胡锦涛同农德孟陈德良举行会谈', '胡锦涛会见巴新总理索马雷'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 20, 1244, 5286, 229]},
		{'word': '企业', 'descriptions': ['企业眼中的出口信用险', '小企业站上国际大舞台', '以项目债为主的企业债停止担保'], 'frequency': [414, 64, 1810, 1940, 1116, 290, 1692, 6692, 15248, 8468, 4722]},
		{'word': '奥运', 'descriptions': ['争看奥运“号外”', '你买到奥运门票了吗？', '百万盆鲜花迎奥运'], 'frequency': [0, 0, 22, 38, 16, 0, 326, 812, 2762, 6474, 650]},
		{'word': '创新', 'descriptions': ['创新中国人才为先', '轮胎产业技术创新战略联盟启动', '自主创新，一个正在升温的话题'], 'frequency': [30, 20, 70, 118, 120, 20, 150, 510, 2932, 8336, 7333]},
		{'word': '服务', 'descriptions': ['仙桃“村民服务站”得民心', '大学生志愿服务西部计划启动', '寓教于审服务群众'], 'frequency': [264, 26, 856, 1994, 1590, 202, 1028, 3102, 7034, 7286, 6475]},
		{'word': '安全', 'descriptions': ['中日举行第五次防务安全磋商', '切实做好“五一”黄金周期间安全生产工作', '广西将全面确保农民饮水安全'], 'frequency': [74, 36, 1208, 1336, 866, 274, 568, 1402, 4966, 6864, 5112]},
		{'word': '和谐', 'descriptions': ['和谐假日需要文明旅游', '履行社会责任促进社会和谐', '经济与科技：在创新中和谐共鸣）'], 'frequency': [8, 0, 0, 6, 0, 4, 4, 32, 108, 4714, 548]},
		{'word': '贾庆林', 'descriptions': ['贾庆林会见缅甸总统吴登盛', '贾庆林会见美国客人', '贾庆林会见意大利客人'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 244, 1924, 127]},
		{'word': '农民工', 'descriptions': ['辩证看待农民工返乡潮', '青少年发展支援项目启动部分农民工子弟学校获助', '从农民工到“技术导师”'], 'frequency': [0, 0, 0, 2, 2, 0, 2, 6, 36, 2296, 510]},
		{'word': '科学发展', 'descriptions': ['马克思主义理论研究和建设工程召开全面落实科学发展观第五次研讨会', '一、科学发展观是推进社会主义现代化必须长期坚持的重要指导思想', '坚持科学发展 建设“四个中心”'], 'frequency': [2, 2, 10, 22, 4, 4, 6, 10, 18, 3676, 284]},
		{'word': '科技', 'descriptions': ['中俄蒙科技展在满洲里开幕', '大学生科技成果：成功拍卖第一槌', '陕西科大三年推广二百项科技成果'], 'frequency': [0, 0, 2, 388, 498, 376, 1088, 3346, 9778, 4182, 3215]},
		{'word': '欧盟', 'descriptions': ['欧盟峰会签署“财政契约”', '欧盟要增强黄金货币属性', '通用效应波及欧盟'], 'frequency': [0, 0, 0, 14, 6, 0, 2, 6, 1860, 2060, 863]},
		{'word': '民生', 'descriptions': ['哈尔滨：民生档案促和谐', '多掂掂民生账', '房地产业具有经济和民生双重属性'], 'frequency': [214, 48, 654, 380, 198, 30, 144, 196, 358, 2384, 1495]},
		{'word': '非典', 'descriptions': ['居民纪念抗击非典两周年', '认真贯彻全国防治非典工作会议精神千方百计促进就业和再就业', '非典对就业的冲击有多大'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 2066, 9]},
		{'word': '健康', 'descriptions': ['四月份我国金融运行健康平稳', '亚健康有了中医临床指南', '在联合国千年发展目标高级别会议妇幼健康战略启动仪式上的发言'], 'frequency': [58, 10, 258, 348, 284, 18, 266, 506, 1886, 2680, 2189]},
		{'word': '人才', 'descriptions': ['关注西部地区培养实用人才', '认真贯彻落实胡主席重要讲话精神  大力培养军队高层次创新型科技人才', '中国国际人才交流大会闭幕'], 'frequency': [4, 4, 68, 110, 12, 74, 464, 1758, 2738, 2946, 1554]},
		{'word': '科学发展观', 'descriptions': ['提高认识  统一思想  牢固树立和认真落实科学发展观', '科学发展观中以人为本的丰富内涵', '用科学发展观指导发展'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 1522, 42]},
		{'word': '均衡', 'descriptions': ['利益均衡：和谐社会的重要内涵', '积极推动义务教育均衡发展', '北京东城区优质教育资源均衡共享'], 'frequency': [0, 0, 110, 66, 20, 6, 34, 26, 56, 230, 137]},
		{'word': '全方位', 'descriptions': ['以全方位金融服务推动文化产业升级', '应城全方位监督“一把手”', '广西全方位资助贫困生'], 'frequency': [0, 0, 0, 0, 0, 0, 4, 16, 196, 160, 203]},
		{'word': '健康成长', 'descriptions': ['北京“阳光心语行动”帮学生健康成长', '做孩子健康成长的金色摇篮', '让孩子在阳光下健康成长'], 'frequency': [0, 0, 0, 14, 56, 4, 46, 24, 108, 152, 76]},
		{'word': '自主创新能力', 'descriptions': ['提高自主创新能力推进结构优化升级', '增强企业自主创新能力大力发展高技术产业', '我国科技自主创新能力再上新高度'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 150, 16]},
		{'word': '走向世界', 'descriptions': ['走进光明  走向世界', '走向世界靠创新', '郭文景：从本乡本土走向世界'], 'frequency': [0, 0, 4, 8, 0, 0, 12, 126, 346, 140, 90]},
		{'word': '贯彻落实科学发展观', 'descriptions': ['深入贯彻落实科学发展观\u3000全面振兴东北老工业基地', '认真贯彻落实科学发展观以发展求和谐以和谐促发展', '努力把贯彻落实科学发展观提高到新水平'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 172, 3]},
		{'word': '生态环境', 'descriptions': ['建立和完善生态环境补偿机制', '以“节约能源资源、保护生态环境、保障安全健康”为主题', '山东生态环境监察试点通过验收'], 'frequency': [0, 0, 0, 0, 0, 0, 2, 46, 268, 186, 296]},
		{'word': '坚持以人为本', 'descriptions': ['经济发展应始终坚持以人为本', '解放军总医院坚持以人为本创建军民满意医院', '坚持以人为本：构建社会主义和谐社会的原则'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 2, 130, 9]},
		{'word': '绿色发展', 'descriptions': ['河北倒逼钢铁工业绿色发展', '将绿色发展理念贯穿城市发展各领域', '清洁空气绿色发展'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 142, 559]},
		{'word': '全球经济', 'descriptions': ['推动全球经济可持续发展之举', '全球经济发展不平衡问题突出南北双方应采取更加务实态度', '全球经济风险中显露机遇'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 8, 78, 162, 219]},
		{'word': '一个中国', 'descriptions': ['印尼、圭亚那重申一个中国政策', '尼将一如既往地坚持一个中国政策', '冰岛继续坚持一个中国原则'], 'frequency': [2, 0, 6, 20, 6, 0, 2, 18, 488, 164, 46]},
		{'word': '文化体制改革', 'descriptions': ['深化文化体制改革  推动文化科学发展', '探索文化体制改革的新路', '《中共中央关于深化文化体制改革推动社会主义文化大发展大繁荣若干重大问题的决定》单行本及党的十七届六中全会文件汇编本出版'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 4, 6, 184, 24]},
		{'word': '火炬传递', 'descriptions': ['保证北京奥运火炬传递绝对安全', '参与火炬传递增强夺冠信心', '把奥运火炬传递和抗震救灾结合起来'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 38, 142, 30]},
		{'word': '理论创新', 'descriptions': ['重大的理论创新 丰硕的实践成果', '立足实际推动社会发展理论创新', '推动文艺批评理论创新）'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 74, 140, 78]},
		{'word': '持续发展', 'descriptions': ['大力发展绿色节能建筑 推动建筑业可持续发展', '从《中国二十一世纪议程》到《可持续发展行动纲要》', '加强生物多样性保护和科学合理利用  提高生态文明水平和可持续发展能力'], 'frequency': [0, 0, 0, 14, 26, 2, 10, 36, 616, 784, 430]},
		{'word': '和谐文化', 'descriptions': ['“和谐文化建设征文”评选揭晓', '营造和谐文化市场环境', '“欢乐春节”传播和谐文化理念'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 112, 1]},
		{'word': '农民致富', 'descriptions': ['一份提案促成农民致富路', '为农民致富“加油”', '用文明和科学照亮农民致富的道路'], 'frequency': [0, 0, 0, 0, 2, 0, 4, 42, 66, 108, 16]},
		{'word': '发展道路', 'descriptions': ['探索符合国情的发展道路', '走适合本国国情的发展道路', '坚持走质量提升为核心的内涵式发展道路开创高等教育改革发展新局面'], 'frequency': [2, 4, 4, 16, 16, 0, 8, 24, 80, 226, 153]},
		{'word': '生产力', 'descriptions': ['温家宝分别会见越南公安部部长和世界生产力科学联盟主席', '只有坚持改革开放才能解放和发展生产力', '从社会有机体角度理解社会生产力'], 'frequency': [18, 0, 24, 114, 116, 24, 42, 182, 322, 168, 76]},
		{'word': '城乡统筹', 'descriptions': ['追踪“城乡统筹”的脚步', '走城乡统筹、一体发展之路', '城乡统筹  党建先行'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 4, 124, 22]},
		{'word': '软实力', 'descriptions': ['文明举止也是软实力', '善表达是一项软实力', '打造军事软实力'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 170, 79]},
		{'word': '中国体育代表团', 'descriptions': ['中共中央国务院致电中国体育代表团祝贺我国体育健儿取得优异成绩', '奥运会中国体育代表团报告团赴川鲁作报告', '“远南”残运会中国体育代表团载誉归来'], 'frequency': [0, 0, 6, 6, 20, 4, 12, 42, 182, 132, 95]},
		{'word': '全面小康', 'descriptions': ['鼓励创业才能全面小康', '在可持续发展中实现全面小康', '继续扎实推进全面小康社会建设'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 0, 98, 179]},
		{'word': '核心竞争力', 'descriptions': ['借助文化提升旅游核心竞争力', '加强领导班子建设提升核心竞争力', '品牌是形成核心竞争力的平台'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 20, 132, 37]},
		{'word': '精神文明建设', 'descriptions': ['精神文明建设“五个一工程”优秀作品回顾', '全国精神文明建设先进工作者候选名单', '中央国家机关精神文明建设和社会事务工作先进受表彰'], 'frequency': [0, 0, 0, 0, 0, 0, 28, 198, 850, 206, 40]},
		{'word': '经济转型', 'descriptions': ['山西金融支持资源型经济转型', '以改革促进经济转型和发展方式转变', '中原经济区可在经济转型中闯出新路'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 6, 146, 124]},
		{'word': '北京残奥会', 'descriptions': ['北京残奥会录用4.4万赛会志愿者', '北京残奥会赛时版官网上线', '国际社会期待北京残奥会谱写新篇章'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 2, 112, 0]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>