<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="3"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		 description: ['乌鲁木齐各族人民迎接尔德节', '中国人民保卫世界和平委员会举行报告会    郭沫若报告世界和平理事会会议的成就', '缅甸掸邦官员在芒市同云南边境官员会见  并参观了芒市为两国边境人民举办的展览馆'],
		 frequency:[7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245],
		 word:'人民',
		 index:2
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 12679},{'text': '生产', 'size': 6669},{'text': '和平', 'size': 6173},{'text': '发展', 'size': 3124},{'text': '志愿军', 'size': 1692},{'text': '粮食', 'size': 1671},{'text': '谈判', 'size': 1470},{'text': '展览会', 'size': 1468},{'text': '支援', 'size': 1449},{'text': '武装', 'size': 1304},{'text': '斯大林', 'size': 1193},{'text': '真理报', 'size': 1163},{'text': '侵略者', 'size': 998},{'text': '人民民主', 'size': 984},{'text': '爱国', 'size': 965},{'text': '细菌战', 'size': 941},{'text': '抗美援朝', 'size': 858},{'text': '工人日报', 'size': 140},{'text': '第一个五年计划', 'size': 140},{'text': '中国共产党中央委员会', 'size': 136},{'text': '农业合作化', 'size': 134},{'text': '文化交流', 'size': 126},{'text': '集体合同', 'size': 124},{'text': '工会组织', 'size': 124},{'text': '工作方法', 'size': 122},{'text': '统一战线', 'size': 122},{'text': '全国人民代表大会代表', 'size': 122},{'text': '十月革命', 'size': 120},{'text': '农业合作化运动', 'size': 120},{'text': '批评和自我批评', 'size': 118},{'text': '工党', 'size': 117},{'text': '文教', 'size': 116},{'text': '开荒', 'size': 114},{'text': '中共中央华北局', 'size': 113},{'text': '同盟', 'size': 111},{'text': '公营企业', 'size': 110},{'text': '社会主义革命', 'size': 110},{'text': '文化建设', 'size': 108},{'text': '民主改革', 'size': 108},{'text': '国营工业', 'size': 106},{'text': '支援前线', 'size': 104},{'text': '殖民主义', 'size': 102},{'text': '苏联最高苏维埃主席团', 'size': 100},{'text': '农田水利', 'size': 100},{'text': '抗美援朝总会', 'size': 100}
],
      wordData: [
		{'word': '人民', 'descriptions': ['乌鲁木齐各族人民迎接尔德节', '中国人民保卫世界和平委员会举行报告会    郭沫若报告世界和平理事会会议的成就', '缅甸掸邦官员在芒市同云南边境官员会见  并参观了芒市为两国边境人民举办的展览馆'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
		{'word': '生产', 'descriptions': ['积极扩大先进生产者队伍', '苏联工人充分利用旧有设备提高生产率', '用新的生产成就欢迎宪法草案'], 'frequency': [4646, 472, 11856, 17896, 11506, 1186, 4036, 5200, 6552, 2826, 1229]},
		{'word': '和平', 'descriptions': ['越南工人阶级为民族独立与世界和平而斗争', '抗议奥地利政府迫害    和平战士布兰德魏纳', '法争和平自由战士协会抗议法反动派迫害居里'], 'frequency': [1574, 406, 11708, 7638, 1660, 360, 1048, 2610, 4664, 2508, 1384]},
		{'word': '发展', 'descriptions': ['发展国际经济合作，改善人民物质条件  波兰准备编制长期经济发展计划', '胡佛演说引起的争论正急剧发展    暴露美统治集团内部分歧扩大    争论双方都承认美国侵略政策已失败', '在不断成长和发展中的保加利亚电影事业'], 'frequency': [1260, 228, 3616, 8240, 9422, 1598, 4514, 9872, 22528, 25846, 18006]},
		{'word': '志愿军', 'descriptions': ['志愿军领导机关欢迎慰问解放军的代表', '关于中国人民志愿军抗美援朝工作的报告', '友爱的会晤\t——记志愿军归国代表团、朝鲜人民访华代表团\t慰问首都某医院志愿军伤病员'], 'frequency': [6, 0, 2636, 440, 146, 20, 28, 72, 128, 38, 66]},
		{'word': '粮食', 'descriptions': ['河南淇县粮食仓库粮食保管工作做得好', '避免国家资财损失    京市粮食公司加强粮食保管', '合肥市大书院选区的粮食核实供应'], 'frequency': [302, 86, 2424, 1932, 1046, 168, 484, 1270, 1834, 1176, 573]},
		{'word': '谈判', 'descriptions': ['爱好和平的人民要求通过和平谈判结束马来亚战争', '我方代表团有关方面发表谈话    痛斥美方破坏停战谈判的卑怯挑衅行动', '开城军民及我谈判代表团集会庆祝朝鲜解放六周年决心为争取实现朝鲜的和平民主独立统一而奋斗'], 'frequency': [154, 4, 2146, 1772, 352, 218, 680, 1848, 2680, 950, 380]},
		{'word': '展览会', 'descriptions': ['湖南举办农具农械展览会', '印度尼西亚艺术展览会闭幕', '在新德里举行的佛教座谈会闭幕  达赖喇嘛和班禅额尔德尼参观佛教艺术展览会'], 'frequency': [54, 48, 1522, 1452, 1032, 158, 190, 474, 660, 108, 26]},
		{'word': '支援', 'descriptions': ['加紧生产支援前线    朝鲜北部各工厂企业    上半年计划超额完成', '上海钢铁公司各厂抽调职工支援国家建设', '朝鲜人民军十五日战报    开城及东海岸地区迎击犯敌    北部农民加紧秋收支援前线'], 'frequency': [734, 50, 1572, 3584, 1474, 132, 274, 652, 910, 470, 103]},
		{'word': '武装', 'descriptions': ['美国加紧武装西德美军一个师开抵不来梅西德雇佣军最高指挥机构成立', '庄严的宣誓定县北疃村人民反对美国重新武装日本', '埃武装部队总司令宣布埃及军队动员完成'], 'frequency': [1074, 30, 1540, 4276, 6832, 238, 618, 842, 1480, 912, 407]},
		{'word': '斯大林', 'descriptions': ['我政法学会贺普里特荣获斯大林和平奖金', '苏联大使馆代表斯大林奖金委员会    授予我国作家丁玲等斯大林奖金', '奖励一九四九年科学发明成绩卓越者\t苏联颁发斯大林奖金\t大批科学家、工程师、设计家、企业负责人、\t工人和集体农民获奖'], 'frequency': [304, 520, 1480, 92, 52, 6, 12, 18, 10, 4, 0]},
		{'word': '真理报', 'descriptions': ['克服戏剧创作的落后现象    苏联《真理报》专论', '真理报评论指出美日军事协定的险恶目的在便利美国完全操纵日本', '美经济已被危机扼住  真理报发表第米多夫论文'], 'frequency': [272, 68, 1412, 380, 22, 6, 26, 48, 28, 0, 0]},
		{'word': '侵略者', 'descriptions': ['约里奥—居里驳斥奥斯汀的无耻诽谤    严词谴责美国侵略者进行细菌战    宣布国际调查团即将赴现地收集美国罪行证据', '美国派遣的朝鲜籍空降特务韩正玉自首    供认被美国派来收集细菌战情报    并揭露美国侵略者准备扩大进行细菌战的罪恶阴谋', '制止美国侵略者的暴行'], 'frequency': [22, 2, 1036, 1604, 1044, 34, 190, 68, 10, 0, 3]},
		{'word': '人民民主', 'descriptions': ['社会主义文化的光辉    ——论人民民主国家的文化革命', '人民民主国家拥护马林科夫演说    认为是对缓和国际紧张局势的新贡献', '人民民主国家对外贸易日益扩大'], 'frequency': [128, 54, 1142, 110, 38, 12, 22, 36, 40, 16, 99]},
		{'word': '爱国', 'descriptions': ['重庆工商界写信报告毛主席去年思想初步改造从而推动业务好转今年要更推进学习建立爱国主义观点', '德国人民抗议西德当局侵犯人权要求停止审讯爱国者和释放他们', '爱国也有够吗'], 'frequency': [236, 34, 1858, 3958, 4666, 140, 280, 454, 1382, 658, 354]},
		{'word': '细菌战', 'descriptions': ['化学工人工会国际号召所属工人    反对美国进行细菌战', '东欧人民民主国家人民集会愤怒抗议细菌战罪行    要求审讯并严惩美国细菌战犯', '向毛主席表示粉碎美国细菌战的决心    清华大学生物系教师职工愿贡献力量扑灭细菌战毒焰'], 'frequency': [0, 10, 1194, 26, 4, 4, 2, 4, 14, 10, 2]},
		{'word': '抗美援朝', 'descriptions': ['华北影片公司加强抗美援朝宣传  普及放映时事新闻影片', '昆明举行抗美援朝代表会议决普查爱国公约扩大捐献', '被遣返的中国人民志愿军病伤人员    写信感谢抗美援朝总会和东北各界的慰问'], 'frequency': [0, 0, 1666, 88, 8, 0, 6, 12, 70, 14, 37]},
		{'word': '工人日报', 'descriptions': ['伦敦《工人日报》记者阿兰·魏宁顿      斥美方挑衅行为危害谈判', '捷副总理祝贺我国人民抗美援朝一周年纽约《工人日报》号召人民迫使美政府撤退侵朝美军', '英国“工人日报”记者阿兰·魏宁顿    痛斥美方滥炸平壤扩大侵略战争的阴谋'], 'frequency': [46, 12, 346, 40, 0, 4, 8, 0, 10, 2, 0]},
		{'word': '第一个五年计划', 'descriptions': ['为了提早完成第一个五年计划更加深入地开展劳动竞赛', '关于发展国民经济的第一个五年计划的报告——在一九五五年七月五日至六日的第一届全国人民代表大会第二次会议上', '学习苏联编制第一个五年计划的经验'], 'frequency': [0, 0, 146, 60, 0, 0, 0, 0, 0, 2, 1]},
		{'word': '中国共产党中央委员会', 'descriptions': ['中国共产党中央委员会致中国人民志愿军的贺电', '加拿大劳工进步党成立三十周年  中国共产党中央委员会致电祝贺', '祝贺朝鲜解放十周年中国共产党中央委员会电'], 'frequency': [24, 2, 146, 72, 50, 6, 2, 8, 8, 10, 29]},
		{'word': '农业合作化', 'descriptions': ['迎接农业合作化运动的新高潮——中共湖南省第七次代表会议旁听记', '新疆加速发展农业合作化运动', '印考察农业合作化代表团到京'], 'frequency': [0, 0, 288, 180, 10, 0, 0, 0, 0, 0, 0]},
		{'word': '文化交流', 'descriptions': ['苏印达成扩大文化交流的协议', '越南民主共和国宣传部发表声明宣布将为南北越文化交流提供一切便利', '日本文化界人士岩村三千夫等致函我国文化界    决努力促进两国文化交流友好合作'], 'frequency': [0, 4, 142, 188, 140, 14, 72, 152, 232, 272, 254]},
		{'word': '集体合同', 'descriptions': ['京西服业签订劳资集体合同', '苏联工业和国营农场等企业  将订今年新集体合同    团结职工争取提早完成五年计划', '丰台机务段实现第二季集体合同    生产运输任务大部超额完成'], 'frequency': [42, 22, 128, 0, 0, 0, 0, 0, 12, 32, 5]},
		{'word': '工会组织', 'descriptions': ['全国工会组织工作会议闭幕\t决定作好工会基层组织工作', '在中国共产党第八次全国代表大会上  进一步发挥工会组织在社会主义建设中的作用  中华全国总工会主席赖若愚同志的发言', '中华全国总工会发出通知    整顿工会组织和干部作风'], 'frequency': [12, 10, 152, 118, 18, 0, 4, 14, 26, 40, 4]},
		{'word': '工作方法', 'descriptions': ['中共上海普陀区各级组织总结工作经验改进领导工作方法', '沈阳第五机器厂    马恒昌组成绩大    创造出许多特出工作方法与制度    东北日报号召向他们学习', '学习中共中央关于春耕生产的指示等文件后    山西平顺县各级干部初步改进了工作方法'], 'frequency': [12, 4, 126, 126, 80, 4, 16, 18, 26, 18, 15]},
		{'word': '统一战线', 'descriptions': ['寮国自由民族统一战线支持和平会议', '就中共中央指示全党文告    民革李济深发表谈话  决努力加强统一战线', '结成更巩固的反帝统一战线！    上海工商业家表示拥护毛主席号召'], 'frequency': [16, 2, 210, 204, 84, 40, 38, 58, 174, 254, 84]},
		{'word': '全国人民代表大会代表', 'descriptions': ['为全国人民代表大会代表团和北京市人民委员会代表团的访问  我驻捷大使曹瑛举行招待会', '广州市举行人民代表大会会议选出广州市的全国人民代表大会代表', '全国人民代表大会代表开始在北京视察'], 'frequency': [0, 0, 160, 76, 6, 4, 2, 8, 26, 40, 51]},
		{'word': '十月革命', 'descriptions': ['莫斯科人民展开生产竞赛迎接十月革命节', '中央人民广播电台组织庆祝十月革命节广播节目', '祝贺伟大的十月革命三十六周年'], 'frequency': [58, 120, 346, 614, 120, 10, 8, 26, 52, 6, 8]},
		{'word': '农业合作化运动', 'descriptions': ['河北省涉县宽漳乡在农业合作化运动中执行阶级政策的情况调查', '农业合作化运动在广东', '给农业合作化运动以及时的帮助'], 'frequency': [0, 0, 122, 68, 2, 0, 0, 0, 0, 0, 0]},
		{'word': '批评和自我批评', 'descriptions': ['认真开展批评和自我批评！    西安铁路分局接受本报批评    检查官僚主义作风    处理莲花寺石场事件', '报纸上的批评和自我批评', '用批评和自我批评的方法开展思想改造运动    学习增加了我的勇气和信心    ——在中央戏剧学院文艺整风学习大会上的报告'], 'frequency': [4, 0, 118, 14, 58, 2, 14, 18, 4, 2, 8]},
		{'word': '工党', 'descriptions': ['英国列席代表、英国工党党员约翰·伯恩斯在亚洲及太平洋区域    和平会议开幕式上的演词', '就英国大选结果回顾工党政策', '历史性的党代表大会     ——纪念俄国社会民主工党第二次代表大会五十周年'], 'frequency': [138, 10, 388, 196, 132, 8, 60, 100, 186, 136, 40]},
		{'word': '文教', 'descriptions': ['文教简讯', '苏联对外文协  主办俄文教授法讲座  五月份讲授讲程排定', '认真做好文教部门的财务和基本建设管理工作'], 'frequency': [64, 28, 306, 302, 82, 14, 38, 58, 98, 66, 34]},
		{'word': '开荒', 'descriptions': ['“送上门去，就地开荒”', '中南军区暨四野各部    半年开荒八十二万亩', '国营友谊农场已开荒一万公顷'], 'frequency': [52, 0, 120, 186, 50, 12, 26, 44, 46, 4, 3]},
		{'word': '中共中央华北局', 'descriptions': ['中共中央华北局关于在华北全区推行祁建华速成识字法，    开展扫除文盲市运动的决定', '中共中央华北局召开手工业工作会议  制订发展手工业合作社的计划', '中共中央华北局召开手工业工作会议  制订发展手工业合作社的计划'], 'frequency': [18, 12, 144, 8, 0, 0, 0, 0, 0, 0, 0]},
		{'word': '同盟', 'descriptions': ['民主同盟中央常务委员会指示各级组织    为开展增产节约反贪污浪费运动而斗争', '中国民主同盟    西北区首届代表大会闭幕    发动盟员积极参加土改工作', '苏联共青团书记赛米恰斯尼谈中苏同盟条约及中苏青年友谊'], 'frequency': [106, 20, 644, 922, 396, 72, 78, 110, 70, 122, 41]},
		{'word': '公营企业', 'descriptions': ['克服关门主义偏向  团结职工发展生产    武汉市工会工作获初步成绩  公营企业实行民主管理，    启发工人提出改善工作的意见，达到改进工作的目的', '南京若干公营企业    生产计划大部完成', '石市公营企业缴齐税款    迟交单位已一律交纳滞纳金'], 'frequency': [134, 22, 118, 2, 2, 0, 0, 2, 0, 0, 0]},
		{'word': '社会主义革命', 'descriptions': ['伟大的十月社会主义革命三十九周年  苏斯洛夫在莫斯科十月革命节庆祝大会上的报告', '苏联共产党中央委员会庆祝伟大的十月社会主义革命卅七周年的号召', '祝贺十月社会主义革命三十九周年纪念  中国人民保卫世界和平委员会的贺电'], 'frequency': [0, 10, 152, 294, 382, 48, 8, 16, 2, 2, 0]},
		{'word': '文化建设', 'descriptions': ['精致的苏联手工艺品    ——介绍苏联经济及文化建设成就展览会中的手工艺品馆', '社会主义农业的技术基础——介绍苏联经济及文化建设成就展览会上的农业机器', '苏联经济及文化建设成就展览会在广州开幕'], 'frequency': [10, 18, 114, 24, 4, 6, 4, 44, 236, 522, 135]},
		{'word': '民主改革', 'descriptions': ['唐山市各工厂经过民主改革\t技术改进产量提高\t炼钢厂生产超过解放前两倍\t开滦煤矿煤工效率突破纪录', '在第一届全国人民代表大会第三次会议上的发言  凉山彝族自治州的民主改革', '经过反封建残余的斗争和民主团结运动武汉裕华纱厂职工团结生产提高打破资方顾虑吸引他们积极参加民主改革'], 'frequency': [2, 0, 108, 124, 8, 0, 0, 8, 20, 48, 8]},
		{'word': '国营工业', 'descriptions': ['发挥现有国营工业企业在建设期中的作用', '高岗在东北局城市工作会议上号召高度发挥国营工业潜在能力加强政治工作实行统一领导', '从红星工厂事件看中共天津市地方国营工业局委员会的责任'], 'frequency': [10, 2, 112, 26, 0, 0, 6, 26, 14, 0, 0]},
		{'word': '支援前线', 'descriptions': ['上海店员欢迎志愿军和朝鲜人民代表    保证贯彻反盗窃斗争支援前线    上海重庆济南等市店员向天津店员应战', '厦门召开各界代表会  一致认为支援前线特别重要    坚决完成购销胜利公债任务', '加紧生产支援前线    朝鲜北部各工厂企业    上半年计划超额完成'], 'frequency': [246, 2, 108, 20, 66, 2, 4, 2, 0, 0, 1]},
		{'word': '殖民主义', 'descriptions': ['纳赛尔总统对苏联记者表示  埃及将永远同殖民主义阴谋作斗争  坚决反对任何夺走和统治苏伊士运河的企图', '苏加诺在美国再谈亚非人民的民族愿望  西方殖民主义是亚非人民的祸害应调整国际关系适应民族解放的现实', '我国海员工会致电支持埃及的正义行动  沈阳伊斯兰教人士谴责殖民主义者对埃及的干涉'], 'frequency': [0, 2, 158, 1696, 612, 44, 18, 24, 6, 2, 4]},
		{'word': '苏联最高苏维埃主席团', 'descriptions': ['苏联最高苏维埃主席团根据布尔加宁提议任命一批国家领导人员', '苏联共产党中央委员会、苏联部长会议、    苏联最高苏维埃主席团联席全体会议的决议', '苏联最高苏维埃主席团根据布尔加宁提议任命一批国家领导人员'], 'frequency': [2, 2, 108, 44, 18, 6, 0, 6, 0, 0, 0]},
		{'word': '农田水利', 'descriptions': ['兴修农田水利，消灭水旱灾害', '农田水利春修工作成绩很大', '贵州计划大量兴修农田水利'], 'frequency': [4, 0, 132, 96, 170, 10, 32, 78, 228, 130, 30]},
		{'word': '抗美援朝总会', 'descriptions': ['中国人民抗美援朝总会直接收到全国各省市慰问金统计表', '中国人民抗美援朝总会委托中国人民银行\t代收慰问中国人民志愿军捐款办法', '中国人民抗美援朝总会  给伤病员和革命残废军人的慰问信'], 'frequency': [0, 0, 228, 0, 0, 0, 0, 0, 0, 0, 0]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 93vh;
	margin-top: -15vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>