<template>
	<div class="wordmain" style="overflow:hidden">
		     
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="1"></words>
					</div>
			
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">
				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		   description:  ['印尼人民将加强解放斗争！印尼人民伟大领袖沙利佛丁等惨遭哈达杀害荷共中央发布讣告哀悼', '陕北军事观察家谈总部五项公报蒋军日衰我军益强人民爱国自卫战争必胜', '抗议英占区当局非法判决德国人民要求释放雷曼'],
		   frequency:[7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245],
		   word:'人民',
		   index:0,
		   url:["http://paper.people.com.cn/rmrb/html/2024-04/29/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/28/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/30/nbs.D110000renmrb_01.htm"]
		   
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 3483},{'text': '歼敌', 'size': 1438},{'text': '蒋军', 'size': 1430},{'text': '解放', 'size': 1356},{'text': '苏联', 'size': 1336},{'text': '胜利', 'size': 1334},{'text': '美帝', 'size': 1196},{'text': '翻身', 'size': 1106},{'text': '地主', 'size': 991},{'text': '收复', 'size': 952},{'text': '民主', 'size': 938},{'text': '前线', 'size': 841},{'text': '蒋介石', 'size': 698},{'text': '冀鲁豫', 'size': 677},{'text': '罢工', 'size': 665},{'text': '北平', 'size': 616},{'text': '武装', 'size': 592},{'text': '解放区', 'size': 544},{'text': '土地改革', 'size': 454},{'text': '统一', 'size': 448},{'text': '政权', 'size': 148},{'text': '解放日报', 'size': 144},{'text': '爱国', 'size': 142},{'text': '生产节约', 'size': 138},{'text': '中共中央', 'size': 134},{'text': '大反攻', 'size': 132},{'text': '边区', 'size': 124},{'text': '游击', 'size': 121},{'text': '清剿', 'size': 120},{'text': '侵华', 'size': 120},{'text': '工潮', 'size': 114},{'text': '人民解放军', 'size': 114},{'text': '击退', 'size': 112},{'text': '进军', 'size': 108},{'text': '大生产', 'size': 102},{'text': '马歇尔计划', 'size': 102},{'text': '新中国', 'size': 100},{'text': '民主军', 'size': 96},{'text': '灾荒', 'size': 94},{'text': '解放后', 'size': 86},{'text': '民主运动', 'size': 84},{'text': '职工会', 'size': 84},{'text': '新战争', 'size': 82},{'text': '总罢工', 'size': 80},{'text': '互助组', 'size': 80}
	],
      wordData: [
      {'word': '人民', 'descriptions': ['印尼人民将加强解放斗争！印尼人民伟大领袖沙利佛丁等惨遭哈达杀害荷共中央发布讣告哀悼', '陕北军事观察家谈总部五项公报蒋军日衰我军益强人民爱国自卫战争必胜', '抗议英占区当局非法判决德国人民要求释放雷曼'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
      {'word': '歼敌', 'descriptions': ['平绥前线我军秋季攻势一个月歼敌万余克城十六座武川萨县均告解放归绥成孤岛', '介休护粮连战连捷蜜蜂联防雷枪结合八天六战歼敌三十', '安东粉碎蒋军进攻我军歼敌八百冀中我克安定车站'], 'frequency': [1490, 28, 520, 634, 1624, 0, 58, 52, 4, 0, 0]},
      {'word': '蒋军', 'descriptions': ['蒋军抓大学生当兵程中志等逃来我区', '蒋军挖毁南岸河堤大泛堪虞五万人民抢修自救冀鲁豫黄委会斥责蒋党寸土不复', '苏皖我军半月歼敌三千拔蒋军据点四十八个北宁路沿线我军收复六据点'], 'frequency': [1676, 0, 140, 298, 14, 0, 0, 2, 0, 0, 0]},
      {'word': '解放', 'descriptions': ['美制蒋机袭解放区损失三十七架空军人员不断退出内战', '列宁与斯大林论东方人民的解放斗争', '以人员弹药支援南线反攻！内黄参军青壮三千余参加苏鲁豫皖解放军冀鲁豫炸弹厂生产空前提高'], 'frequency': [3796, 456, 4462, 7978, 11514, 514, 762, 1196, 1648, 952, 304]},
      {'word': '苏联', 'descriptions': ['旅大工展九月开幕检阅全区工业生产力量加强学习苏联建设经验', '列宁的正义苏联民间故事', '平两万青年盛大集会庆祝世界青年节日廖承志等号召向苏联学习游艺节目充满青年人的活力'], 'frequency': [1642, 760, 12318, 11968, 3846, 2412, 3922, 4016, 1564, 24, 4]},
      {'word': '胜利', 'descriptions': ['希民主政府总理马科斯报告土地改革正大力进行民主军已胜利的予敌重创', '胜利不是偶然的', '总部发言人评解放石家庄之捷我军反攻使敌顾此失彼更大胜利必将连串到来'], 'frequency': [1408, 320, 2720, 5552, 9268, 598, 338, 710, 916, 984, 555]},
      {'word': '美帝', 'descriptions': ['参加四外长会议莫洛托夫抵达伦敦美帝一意孤行企图分裂德国', '美帝加紧奴役印尼', '舒曼听命美帝实行法郎贬值法劳动人民强烈反对全法展开保护民族工业运动'], 'frequency': [1284, 180, 2306, 7946, 11638, 4, 2, 0, 0, 0, 0]},
      {'word': '翻身', 'descriptions': ['武安河西村群众渴望民主老干部长期统治群众土地大体填平，农民在政治上经济上并未彻底翻身。', '双方献思想表态度范县中贫农团结翻身', '八百年两族裂痕今日消解  博爱回汉民同庆翻身万人会上回汉民互赠礼物齐向毛主席致敬同声怒吼团结翻身联合打垮蒋介石进攻'], 'frequency': [1204, 4, 134, 206, 222, 30, 32, 82, 56, 44, 25]},
      {'word': '地主', 'descriptions': ['安阳蒋伪横征暴敛“土地已成农民毒瘤”蒋军到处穷富遭殃农民地主团结抗蒋', '晋绥某部清算地主思想调整成份贫雇战士成为部队骨干', '地主破坏生产沙河农民识破阴谋'], 'frequency': [1060, 6, 158, 380, 120, 6, 6, 10, 2, 6, 5]},
      {'word': '收复', 'descriptions': ['我军出击平汉北段收复望都俘敌千余南满我军收复据点数十处月初以来歼敌一千六百余', '刘邓大军到大别山后四个月歼蒋匪五万收复县城三十三座', '总部公布半月胜利作战我军歼敌共达二万收复城市二十四座'], 'frequency': [982, 2, 62, 282, 252, 98, 74, 72, 84, 26, 31]},
      {'word': '民主', 'descriptions': ['中国民主同盟发表宣言完全拥护毛主席八项和平条件', '中共晋冀鲁豫中央局关于土地改革整党与民主运动的指示', '解放军收复延安民主圣地  标志全国胜利日近各解放区人民欢欣祝捷'], 'frequency': [2972, 420, 6718, 6278, 3650, 544, 886, 2376, 3016, 1660, 972]},
      {'word': '前线', 'descriptions': ['军区补充团新战士纷纷要求开赴前线把学好的本领到战场上去缴美国武器', '西北前线我某指挥员接见战俘李日基等李畏罪自供未敢下破坏令', '洪赵临浮人民再次涌上前线  炮火下奋勇救伤员保卫浮山城数万民兵配合主力歼灭蒋伪劳武结合组织参战不误生产'], 'frequency': [1264, 40, 996, 688, 558, 60, 56, 390, 106, 40, 20]},
      {'word': '蒋介石', 'descriptions': ['一个大讽刺！蒋介石命令郑洞国等撤出长春这手令已由曾泽生交给解放军', '解放区青年妇女文化各界声援全国学生爱国运动痛斥蒋介石卖国媚外无耻行为', '匪首蒋介石“离职”前曾作各种阴谋布置'], 'frequency': [712, 2, 102, 258, 82, 4, 6, 8, 6, 0, 1]},
      {'word': '冀鲁豫', 'descriptions': ['冀鲁豫各地揭破地主欺骗狡计挖出大量隐蔽资财', '晋冀鲁豫边区政府  晋察冀边区行政委员会通令公字第一号为取消巩固区内路条制度由令各级政府机关', '冀鲁豫地方武装全面出击配合反攻歼敌四千'], 'frequency': [1296, 0, 6, 22, 8, 4, 2, 12, 14, 4, 1]},
      {'word': '罢工', 'descriptions': ['蒋区物价已如脱缰野马罢工罢教抢粮愈演愈烈蒋家官员窘态凶相毕露', '舒曼反动内阁被迫屈服法国总罢工胜利结束总工会号召加强团结准备未来斗争', '比利时钢铁工人二十五万大罢工都灵伦敦也爆发大工潮'], 'frequency': [834, 80, 832, 1614, 2364, 110, 462, 502, 288, 42, 25]},
      {'word': '北平', 'descriptions': ['为建设新北平作准备市区典型调查完成', '北平中苏友协主办演讲会陈绍禹今在中山公园讲演：“我们对苏联应有的认识”', '北平与华中六市恢复电报通讯'], 'frequency': [1510, 6, 26, 42, 14, 0, 8, 24, 22, 6, 10]},
      {'word': '武装', 'descriptions': ['太岳地方武装获胜豫西岳北一个月歼匪一千五百', '华东急剧开展武装保麦斗争', '太行五分区武装部指示所属  加强新区武装工作肃清一切土匪武装'], 'frequency': [1074, 30, 1540, 4276, 6832, 238, 618, 842, 1480, 912, 407]},
      {'word': '解放区', 'descriptions': ['解放区铁路万八千公里万三千公里修复通车现有铁路线已占全国百分之八十', '西北解放区的行政区划', '东北解放区巩固扩大工农商业日益发展中'], 'frequency': [698, 14, 82, 634, 1316, 0, 24, 22, 26, 6, 4]},
      {'word': '土地改革', 'descriptions': ['南斯拉夫的土地改革', '土地改革中的几个问题', '冀南组织大批干部突击落后村加紧完成新区土地改革武训深入运动进行翻身大检查健全组织开展时事教育为全面抵抗胜利奠定基础'], 'frequency': [496, 20, 498, 118, 0, 0, 2, 8, 6, 10, 2]},
      {'word': '统一', 'descriptions': ['统一推行新币还要爱护旧币太行确定稳定物价办法', '保加利亚农民联盟维护祖国阵线统一', '统一领导按活分红潞城解决运输支差矛盾'], 'frequency': [574, 92, 1650, 2766, 2204, 276, 734, 1228, 2414, 1468, 679]},
      {'word': '政权', 'descriptions': ['华北人民监察院决聘通讯检查员联系群众监督政权及时纠正错误改进工作巩固国家纪律', '东北冬季攻势又获一大胜利新立屯歼守敌一师新民县已建立民主政权分粮食给雇贫  坚决贯彻团结中农保护工商业的政策', '东蒙自治会发言人声明坚决抗击进犯蒋军提议成立内蒙统一政权'], 'frequency': [226, 20, 278, 772, 1742, 94, 290, 320, 304, 150, 61]},
      {'word': '解放日报', 'descriptions': ['张永泰的道路解放日报社论', '解放日报社论号召准备开展春耕生产完成土地改革是开展生产的关键战斗部队应该特别注意节约民力', '热烈响应解放日报号召冀鲁豫前线部队普遍学习王克勤'], 'frequency': [168, 4, 16, 24, 24, 0, 0, 8, 12, 4, 0], 'url':["http://paper.people.com.cn/rmrb/html/2024-05/29/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/28/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/30/nbs.D110000renmrb_01.htm"]},
      {'word': '爱国', 'descriptions': ['蒋特阴谋捕杀爱国分子北平学生团结抗暴', '保卫祖国的安全与独立蒋区爱国运动新高涨', '国民党宣传上混乱矛盾曾招认美国扶日事实依照其主子命令又诬蔑学生爱国运动'], 'frequency': [236, 34, 1858, 3958, 4666, 140, 280, 454, 1382, 658, 354]},
      {'word': '生产节约', 'descriptions': ['迎接“五一”太行实业公司各矿厂将开展生产节约竞赛', '中直检查生产节约发现了不少积极分子与模范各机关已取得初步生产经验', '冀南深入生产节约任县各级机关积极淋盐熬硝'], 'frequency': [154, 8, 32, 10, 0, 0, 0, 0, 0, 2, 0]},
      {'word': '中共中央', 'descriptions': ['中共中央华中局的今后工作方针林彪同志在汉口“七一”纪念会上的报告', '中共中央发言人严斥蒋美肮脏买卖抵押海关换金元打内战维护国家主权只有加速打倒蒋介石', '中共中央发言人揭露蒋党阴谋迫害民主人士指出人民最后清算血债已为时不远'], 'frequency': [246, 36, 974, 866, 662, 122, 80, 242, 648, 828, 470]},
      {'word': '大反攻', 'descriptions': ['各地纪念党的生日加紧工作支援前线前线庆祝“七一”刘伯承将军麾下表示要在大反攻中打好仗', '庆祝胜利揭开大反攻光荣序幕中央局电贺前线将士刘邓首长嘉奖某兵团郓城大捷', '庆祝胜利揭开大反攻光荣序幕中央局电贺前线将士刘邓首长嘉奖某兵团郓城大捷'], 'frequency': [142, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0]},
      {'word': '边区', 'descriptions': ['陕甘宁边区征购土地条例草案', '边区财经办事处决定：禁止染颜料纸烟原料入口', '陕甘宁边区决定优待军烈属新办法一切按土地法办事'], 'frequency': [440, 2, 14, 26, 8, 4, 12, 32, 38, 14, 5]},
      {'word': '游击', 'descriptions': ['纪念全国起义及意北解放三周年意北游击队员大示威', '丰县华砀游击队逐步扩展打到那里那里分田敌后土地改革的几点体验', '冀南日报发表社论肃清残存和平幻想坚持岗位严守纪律要求发扬光大游击作战本领'], 'frequency': [950, 46, 238, 594, 1438, 14, 994, 806, 620, 44, 16]},
      {'word': '清剿', 'descriptions': ['南通等八县军民胜利破敌“硬性清剿”', '关中我军奋战三周粉碎敌二次“清剿”', '反“清剿”中人人坚强苏中农村兵营化'], 'frequency': [122, 6, 22, 12, 4, 0, 2, 0, 38, 66, 19]},
      {'word': '侵华', 'descriptions': ['美蒋签订“救济协定”掩饰卖国侵华罪行', '全国学联发表宣言抗议美国侵华政策', '美侵华援蒋计划执行人莱普汉抵沪'], 'frequency': [126, 2, 46, 28, 14, 0, 64, 32, 108, 50, 85]},
      {'word': '工潮', 'descriptions': ['物价暴涨中天津发生工潮', '西班牙人民反抗佛朗哥工潮遍及全国游击队活跃马德里附近', '蒋党压榨下工人无法生活上海工潮广泛蔓延'], 'frequency': [136, 0, 0, 2, 0, 0, 0, 16, 36, 10, 0]},
      {'word': '人民解放军', 'descriptions': ['淮北人民解放军一日双捷逼近泗阳城克敌据点苏中苏北半月歼灭蒋伪六千', '中国人民解放军北平市军事管制委员会布告', '告湖南将士书听候指挥，配合人民解放军，指向人民敌人！士兵们非人生活苦不堪言要抓住敌人，惩办清算。'], 'frequency': [326, 38, 614, 318, 1332, 66, 46, 112, 212, 186, 63]},
      {'word': '击退', 'descriptions': ['印尼军坚持持久战击退三宝珑等地进犯荷军在荷占区广泛展开游击战', '运城临汾蒋军出犯被我击退', '警惕！  武装特务袭扰码头  包围民兵被我击退'], 'frequency': [112, 2, 146, 246, 182, 10, 68, 72, 36, 4, 5]},
      {'word': '进军', 'descriptions': ['剿灭土匪是第二线进军华东召开剿匪工作会议经三月清剿全区已无大股土匪今后方针采军事扑灭政治攻势和发动群众三者齐头并进', '美帝图谋疯狂镇压国内进步势力全美掀起反蒙特法运动将于六月二日举行全国性示威进军', '万水千山只等闲！记解放军某部在暴风雨中翻越荆山的进军'], 'frequency': [126, 24, 184, 336, 128, 104, 82, 146, 496, 320, 112]},
      {'word': '大生产', 'descriptions': ['资本家为工业前途欢欣决遵循毛主席指示提高技术扩大生产', '从多方面准备大生产用浮财买水车明年浇地不困难', '打柴积肥纺织运输黎城积极准备明年大生产'], 'frequency': [168, 18, 110, 104, 12, 2, 12, 18, 24, 14, 5]},
      {'word': '马歇尔计划', 'descriptions': ['马歇尔计划正走向崩溃', '苏联劳动报评论称：马歇尔计划落了空美经济危机将加深', '在“马歇尔计划”下法国经济陷于停滞法对美的附属性越来越大变成农业国的口号又复活'], 'frequency': [102, 6, 32, 0, 0, 0, 0, 0, 4, 0, 1]},
      {'word': '新中国', 'descriptions': ['在中共领导下革命必然成功民主新中国必然实现李济深先生发表演说', '傅作义将军通电声明政治立场愿在毛主席领导下实行新民主主义，建设新中国', '论新中国的水力建设'], 'frequency': [140, 218, 604, 106, 76, 8, 46, 40, 352, 386, 177]},
      {'word': '民主军', 'descriptions': ['希民主军连获大捷极北部歼敌四千接续发动攻势歼敌一师大部缴获一旅的装备', '美英直接指挥希腊伪军攻势被民主军彻底打败反攻占领卡拉夫鲁塔等两城', '格拉姆斯山区希民主军挺进敌后'], 'frequency': [214, 4, 2, 0, 0, 0, 0, 0, 0, 0, 1]},
      {'word': '灾荒', 'descriptions': ['陕甘宁战胜灾荒秋季获八成丰收', '冀中青县大城等地组织雹灾地区群众抢种晚苗战胜灾荒', '结合春耕搞副业男女动手渡灾荒'], 'frequency': [96, 8, 160, 24, 4, 0, 0, 0, 10, 0, 0]},
      {'word': '解放后', 'descriptions': ['人民的长春解放前惨遭国民党匪帮破坏解放后八个月即已欣欣向荣', '大上海解放后', '平津解放后石市私营工商业动向'], 'frequency': [88, 8, 60, 56, 16, 0, 4, 2, 2, 2, 0]},
      {'word': '民主运动', 'descriptions': ['面对高涨的民主运动与经济危机美统治集团意见分歧新时代评美参院对批准侵略公约的辩论', '东禅村经过整党民主运动党员积极领导春耕动员种棉中表现作风已大转变', '军队中的民主运动'], 'frequency': [88, 4, 34, 80, 8, 0, 6, 10, 2, 0, 1]},
      {'word': '职工会', 'descriptions': ['大连职工会在生产运动中的作用东北工会工作经验之一', '平市机制面粉业职工会正式成立', '波职工会主席在中全会上号召巩固工人与农民的联盟实现国家复兴三年计划'], 'frequency': [244, 10, 12, 58, 0, 0, 0, 0, 2, 2, 0]},
      {'word': '新战争', 'descriptions': ['季米特洛夫发表谈话：美反动派势必失败保决与苏联及进步势力一起积极斗争挫败新战争煽动者', '答复合众社社长白理问  斯大林发表时局谈话否认贝纳斯所说美苏关系日益紧张指出必须揭穿与铲除新战争挑拨者', '各国热烈庆祝三八节国际妇联号召妇女们反对美帝新战争贩子'], 'frequency': [84, 22, 94, 94, 98, 6, 0, 0, 8, 6, 0]},
      {'word': '总罢工', 'descriptions': ['东京山雨欲来风满楼明日将开打倒吉田内阁大会四千青年行动队员开始示威二百七十万人总罢工必爆发', '全意农业区各业工人二百五十万人总罢工声援坚持罢工中的农业工人', '青岛陷于饥饿困境染织工人总罢工新乡小学教员请愿索薪'], 'frequency': [80, 16, 96, 260, 134, 4, 42, 90, 46, 2, 1]},
      {'word': '互助组', 'descriptions': ['前线各部队开展王克勤运动战斗学习收效很大大家一致认为：有了互助组什么任务都能完成。', '某团七连一班互助得好在战斗中无一伤亡晋南我军出现许多模范互助组', '钱如桂互助组坚持四年人人得利等价问题应很好解决'], 'frequency': [130, 0, 484, 32, 4, 0, 0, 0, 8, 0, 2]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
		 this.chartData.index=0;
		 this.chartData.url=foundWord.url;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
	margin-top: 5vh;
}
.wordcloudmain{
	width:40vw;
	height:100vh;
	
}
.wordcloudside{
	width:30vw;
	height:100vh;
}
.words{
    width: 40vw;
    height: 90vh;
  
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>