<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="2"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		  description: ['伟大的十月社会主义革命和苏联艺术的繁荣', '华大工会业余学校开学成仿吾、聂真讲话号召学习苏联经验，培养大批工农干部', '苏联文化艺术科学工作者代表团副团长西蒙诺夫广播演讲词'],
		  frequency:  [1642, 760, 12318, 11968, 3846, 2412, 3922, 4016, 1564, 24, 4],
		  word:'苏联',
		  index:1,
		  // url:["http://paper.people.com.cn/rmrb/html/2024-04/29/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/28/nbs.D110000renmrb_01.htm","http://paper.people.com.cn/rmrb/html/2024-04/30/nbs.D110000renmrb_01.htm"]
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 256},{'text': '苏联', 'size': 219},{'text': '成立', 'size': 200},{'text': '庆祝', 'size': 142},{'text': '毛主席', 'size': 136},{'text': '人民政府', 'size': 93},{'text': '美帝', 'size': 90},{'text': '中央', 'size': 81},{'text': '胜利', 'size': 78},{'text': '新中国', 'size': 78},{'text': '拥护', 'size': 68},{'text': '新中国诞生', 'size': 60},{'text': '电贺', 'size': 60},{'text': '首都', 'size': 55},{'text': '人民政协', 'size': 51},{'text': '邦交', 'size': 50},{'text': '团结', 'size': 44},{'text': '国民党', 'size': 32},{'text': '友好', 'size': 30},{'text': '民主', 'size': 29},{'text': '保卫和平', 'size': 26},{'text': '国际', 'size': 26},{'text': '劳动人民', 'size': 24},{'text': '毛泽东主席', 'size': 24},{'text': '政务院', 'size': 24},{'text': '联合', 'size': 22},{'text': '维辛斯基', 'size': 22},{'text': '中华人民共和国', 'size': 20},{'text': '共同纲领', 'size': 20},{'text': '妇女', 'size': 20},{'text': '政协', 'size': 20},{'text': '苏代表团', 'size': 20},{'text': '战争', 'size': 20},{'text': '祖国', 'size': 20},{'text': '广泛', 'size': 20},{'text': '统一', 'size': 20},{'text': '巩固', 'size': 18},{'text': '救灾', 'size': 18},{'text': '法西斯', 'size': 18},{'text': '工作会议', 'size': 18},{'text': '出口', 'size': 18},{'text': '外交关系', 'size': 16},{'text': '文艺', 'size': 16},{'text': '中国人民政协', 'size': 16},{'text': '人民民主', 'size': 16}
	],
      wordData: [
		{'word': '人民', 'descriptions': ['关于中华人民共和国国庆日的决议', '关于减租减息合理负担与工商政策问题饶漱石在松江全县各界人民代表会议的讲话', '大别山南麓八个区肃清股匪建立人民政权张国权分区司令员纵谈南线剿匪情况'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
		{'word': '苏联', 'descriptions': ['伟大的十月社会主义革命和苏联艺术的繁荣', '华大工会业余学校开学成仿吾、聂真讲话号召学习苏联经验，培养大批工农干部', '苏联文化艺术科学工作者代表团副团长西蒙诺夫广播演讲词'], 'frequency': [1642, 760, 12318, 11968, 3846, 2412, 3922, 4016, 1564, 24, 4]},
		{'word': '成立', 'descriptions': ['发展少数民族文化国立回民学院成立', '中华人民共和国中央人民政府成立庆祝大会入场须知', '中苏友好协会成立大会上刘少奇会长报告全文'], 'frequency': [1350, 390, 2794, 3302, 2856, 300, 1350, 3540, 7538, 3464, 1800]},
		{'word': '庆祝', 'descriptions': ['中国三大青年学生团体关于庆祝世界青年日举行宣传周的通知', '新疆庆祝大会电毛主席致敬', '全德人民热烈庆祝欢迎斯大林贺电认为苏联是民主德国真正友人'], 'frequency': [614, 354, 3960, 6194, 5906, 870, 1030, 1716, 2744, 2042, 698]},
		{'word': '毛主席', 'descriptions': ['东北铁路员工电毛主席报告提前完成装车计划', '大连广和机械工厂职工向毛主席报告生产成绩努力向苏联学习建设伟大祖国', '毛主席在十年前所作的庆祝斯大林六十寿辰的论文和演说'], 'frequency': [656, 330, 2632, 2782, 17280, 1118, 130, 36, 172, 24, 4]},
		{'word': '人民政府', 'descriptions': ['伪资源委员会驻港员工宣布脱离匪帮残余政府保护资财致电中央人民政府静候接收', '北京市人民政府公安局通告总秘通字第１５７号', '中央人民政府政务院关于发行一九五零年第一期人民胜利折实公债的指示'], 'frequency': [924, 458, 3160, 54, 6, 0, 38, 118, 48, 34, 22]},
		{'word': '美帝', 'descriptions': ['美帝图谋继续捣乱我国将以七千五百万美元在新中国建立谍报网', '民主朝鲜报斥美帝利用联合国干涉朝鲜', '美帝为雅典匪徒狡辩竟谓无权制止其罪行'], 'frequency': [1284, 180, 2306, 7946, 11638, 4, 2, 0, 0, 0, 0]},
		{'word': '中央', 'descriptions': ['巩固人民民主专政松江举行各界人民代表会中共中央华东局书记饶漱石亲临致词大会团结一致开诚商讨充分发扬民主', '访问“人民大厦”捷共中央党校', '中央、北京人民广播电台 广播要目'], 'frequency': [878, 446, 7484, 5214, 4484, 822, 1072, 2510, 4962, 5422, 3247]},
		{'word': '胜利', 'descriptions': ['中央人民政府财政部委托人民银行发行人民胜利折实公债通告', '掀起认购胜利公债运动全国各地开始预购工人阶级响应全总号召争取认购第一名', '对发行胜利公债的意见'], 'frequency': [1408, 320, 2720, 5552, 9268, 598, 338, 710, 916, 984, 555]},
		{'word': '新中国', 'descriptions': ['捷克农民中央会议电贺新中国成立欢呼毛主席万岁', '世界进步报刊祝贺新中国诞生波人民论坛报著论拥护波政府承认我国认为当代历史上最重要的事件正在东亚发生', '在自由中国法捷耶夫发表访问新中国专文'], 'frequency': [140, 218, 604, 106, 76, 8, 46, 40, 352, 386, 177]},
		{'word': '拥护', 'descriptions': ['师大清华两教授拥护发行胜利公债', '上海召开二届各界代表会议讨论克服当前财经困难贯彻中央人民政府委员会四次会议精神团结一致拥护并推行人民胜利折实公债', '拥护全国财政收支概算及发行公债决定全总发表告全国工人书号召踊跃认购公债开展生产节约'], 'frequency': [570, 194, 2280, 528, 350, 38, 50, 82, 176, 76, 40]},
		{'word': '新中国诞生', 'descriptions': ['伊朗劳动党及妇女青年团体电贺新中国诞生越南青联电我国青联致贺', '张市人民欢声四起庆祝新中国诞生', '美民主远东政策委员会电贺人民新中国诞生古巴人民社会党电毛主席祝贺'], 'frequency': [12, 70, 4, 0, 0, 0, 0, 0, 2, 2, 1]},
		{'word': '电贺', 'descriptions': ['爱尔兰中国学生联合会电贺毛泽东主席', '我国各民主党派联名电贺斯大林寿辰并定明晚举行庆祝晚会', '美苏友协庆祝十月节维辛斯基金斯贝莱等演说巴黎劳动人民电贺斯大林'], 'frequency': [394, 132, 632, 1868, 644, 96, 194, 238, 236, 220, 26]},
		{'word': '首都', 'descriptions': ['南斯拉夫首都贝尔格莱德竟成美帝间谍阴谋中心', '中国地质学会首都区年会闭幕讨论总结地质教育及工作', '迎接第一个人民胜利年首都筹备新年大联欢公营工厂布置文娱活动'], 'frequency': [24, 158, 1562, 4010, 2718, 294, 682, 1898, 3700, 1116, 398]},
		{'word': '人民政协', 'descriptions': ['贯彻人民政协共同纲领全国新华书店出版工作会议开幕朱德副主席号召迎接文化建设高潮中共中央宣传部长陆定一勉团结帮助全国出版界进步', '莫斯科各报刊载毛主席当选消息塔斯社转播人民政协宣言全文', '政务院各机构正式办公水利、文化、教育三部及新闻、出版两总署昨召开成立会中共中央华东局号召认真学习人民政协文献'], 'frequency': [240, 84, 252, 4, 0, 0, 6, 26, 72, 186, 73]},
		{'word': '邦交', 'descriptions': ['保、罗居沪侨民拥护与我建立邦交', '捷与人民中国建立邦交将使两国关系辉煌发展捷国民议会外委会主席发表谈话', '德意志民主共和国外交部发表外交政策声明承认波茨坦协定坚决巩固德苏友好愿意与各国基于互尊平等建立邦交'], 'frequency': [8, 64, 194, 260, 186, 10, 8, 12, 60, 22, 8]},
		{'word': '团结', 'descriptions': ['工人阶级的团结与共产党及工人党的任务情报局决议', '各阶层各行业妇女空前大团结京妇代会隆重开幕大会任务：交流经验，确定方针，成立北京市民主妇联会', '全世界一切爱好和平民主的人们紧紧团结在斯大林周围干杯！为中国人民，为中国共产党，为中国人民领袖毛泽东；为走向社会主义的各人民民主国家的人民，为各兄弟共产党，为全世界一切劳动者，为全世界一切民主力量的大团结！'], 'frequency': [924, 168, 1750, 6014, 8570, 978, 1320, 1778, 1744, 1014, 722]},
		{'word': '国民党', 'descriptions': ['不再为残匪卖命前国民党一一九军正副军长王治岐蒋汉城发出起义通电', '渝郊继续发现埋尸群众痛恨国民党匪帮的暴行践踏戴笠“灵位”撕碎凶像', '联大政委会辩论议程美蒋无耻阴谋受挫提前讨论国民党诽谤建议被否决'], 'frequency': [644, 112, 380, 144, 24, 2, 54, 238, 140, 270, 72]},
		{'word': '友好', 'descriptions': ['美英进步人民集会主张与苏中友好合作', '巩固发展中苏友谊沟通两国文化北京中苏友好协会成立彭真王之相等当选会长副会长', '中苏友好协会章程'], 'frequency': [218, 132, 1782, 5194, 9574, 2066, 1574, 2334, 2634, 1832, 922]},
		{'word': '民主', 'descriptions': ['苏联以大批科学书籍赠送各人民民主国家送我国各地书刊逾四千册', '国际民主法律工作者第四次代表大会揭幕苏白俄罗斯波意等代表团参加', '德国民主进步舆论欢迎崔可夫声明'], 'frequency': [2972, 420, 6718, 6278, 3650, 544, 886, 2376, 3016, 1660, 972]},
		{'word': '保卫和平', 'descriptions': ['全国民主妇联举行茶会招待苏联朝鲜女代表蔡畅号召和苏朝姊妹携手，反对新战争挑拨者，保卫和平。', '巴黎数万青年举行保卫和平大会德人民呼吁无条件禁用原子弹比国各地筹备今天开群众大会', '伏兹尼在青年反法西斯座谈会报告苏联青年英勇斗争保卫祖国保卫和平'], 'frequency': [174, 46, 882, 354, 6, 2, 4, 6, 0, 2, 1]},
		{'word': '国际', 'descriptions': ['北京各界人民庆祝亚澳工会会议成功大会各代表讲词团结国际友人学习国际经验建设人民国家人民首都北京市长聂荣臻讲话', '劳动报评论从米兰到北京国际工人的两个重要会议是工运发展的两个里程碑', '努力生产增加国家财富支持国际工人阶级斗争全国各地热烈庆贺亚澳工会会议'], 'frequency': [590, 196, 4196, 5082, 3004, 660, 2356, 6990, 17496, 8906, 5053]},
		{'word': '劳动人民', 'descriptions': ['展开向伟大斯大林祝寿的运动保国献礼专车自索非亚出发数万劳动人民赴站欢送', '保障生产安全和劳动人民福利中国人民保险公司成立中国人民银行召开保险工作会议确定业务方针上海设立中国保险公司开展海外业务', '亚洲千百万劳动人民团结一致为和平民主与民族解放而斗争劳动报论亚澳工会代表会议'], 'frequency': [224, 78, 834, 610, 640, 34, 24, 14, 14, 6, 3]},
		{'word': '毛泽东主席', 'descriptions': ['捷共编译中国人民政协文献毛泽东主席特撰序文这些文献将帮助欧洲人民认识新中国', '毛泽东主席致词受听众热烈欢迎', '中央人民政府毛泽东主席中国共产党中央委员会祝贺斯大林七十寿辰'], 'frequency': [8, 38, 394, 260, 260, 36, 2, 0, 2, 2, 0]},
		{'word': '政务院', 'descriptions': ['中央防疫委员会呈请政务院批准京绥路恢复通车察北防疫封锁线部分撤消鼠疫尚未根绝仍应严格检疫', '政务院开第三次会议通过所属各机构组织通则任命四委员会秘书长及各局局长呈请主席批准任命绥远省政府名单', '中央人民政府政务院关于生产救灾的指示'], 'frequency': [0, 86, 1296, 0, 36, 4, 8, 30, 6, 0, 0]},
		{'word': '联合', 'descriptions': ['印尼邦加劳工联合会电贺我中央人民政府毛主席复电热忱感谢', '通过禁止原子武器建议对巩固联合国有重要意义', '华东、平原联合召开水利会议统一解决山东等省水患黄委会决定举办引黄济卫工程'], 'frequency': [780, 140, 4406, 6732, 6196, 614, 2152, 4766, 7622, 4550, 2532]},
		{'word': '维辛斯基', 'descriptions': ['维辛斯基在联大政委会演说谴责美英新战争准备主张禁用及管制原子武器并缔结五强加强和平公约', '维辛斯基在联大发表重要演说揭发美英毁谤保匈罗可耻阴谋指出侵犯人权者正是美英及其喽啰', '维辛斯基在联大发表重要演说揭发美英毁谤保匈罗可耻阴谋指出侵犯人权者正是美英及其喽啰'], 'frequency': [66, 64, 408, 0, 0, 0, 4, 0, 0, 0, 0]},
		{'word': '中华人民共和国', 'descriptions': ['中华人民共和国的成立是和平阵营的一大胜利', '关于中华人民共和国国庆日的决议', '全印职工大会电我全总祝贺中华人民共和国诞生'], 'frequency': [32, 38, 854, 864, 880, 104, 218, 572, 1282, 1392, 914]},
		{'word': '共同纲领', 'descriptions': ['保加利亚工人职员们热烈讨论我共同纲领', '人民政协教育界代表座谈共同纲领文教政策柳湜报告老区文化教育情形', '周恩来关于人民政协共同纲领的报告捷“红色权力”报全文刊载'], 'frequency': [16, 24, 52, 2, 2, 2, 0, 0, 0, 0, 0]},
		{'word': '妇女', 'descriptions': ['国际民主妇联为民族独立与和平的斗争国际民主妇联总书记古久里夫人在亚洲妇女代表会议上的报告', '关于“保护亚洲妇女权利”伊朗代表玛辛·法洛琪报告摘要', '国际木材、建筑业工会部向中国工人阶级祝贺越妇联电贺中国妇女参加政府我全国妇联蔡畅主席复电致谢'], 'frequency': [1126, 316, 2082, 2490, 1534, 148, 554, 1146, 2104, 1132, 327]},
		{'word': '政协', 'descriptions': ['中国人民政协全国委员会举行第一次会议毛泽东当选全国委员会主席周恩来李济深沈钧儒郭沫若陈叔通当选副主席李维汉任秘书长建议中央人民政府定十月一日为中华人民共和国国庆纪念日', '中国人民政协代表访问记彝族代表张冲', '人民解放军某部等热烈学习人民政协文件一致认为必须树立永远是战斗队的思想保卫新中国'], 'frequency': [358, 124, 670, 1172, 62, 226, 390, 1438, 2264, 2246, 1152]},
		{'word': '苏代表团', 'descriptions': ['苏代表团团长法捷耶夫致答词', '沪各界人民代表两千人集会欢迎苏联文化代表团饶漱石欢迎词中指出：苏代表团出现上海，表示亚洲和世界已走上新轨道。', '参加亚洲妇女代表会议苏代表团抵京'], 'frequency': [40, 36, 80, 52, 2, 0, 2, 2, 4, 0, 0]},
		{'word': '战争', 'descriptions': ['法越战争爆发三周年纪念日胡志明号召军民奋战誓必全歼法殖民军争取完全胜利', '美国正是新战争准备中心奥斯汀无法反驳这一事实', '法人民展开广泛运动反对对越南殖民战争法兵七名跳海拒绝赴越作战'], 'frequency': [948, 100, 2996, 4832, 4826, 208, 464, 810, 1132, 788, 336]},
		{'word': '祖国', 'descriptions': ['表现着对于祖国的热爱铁路区行列显示载运量高度纪录人民用极大创造性装饰节日行列', '爱护我们的祖国拥护毛泽东主席中国新民主主义青年团中央委员会副书记', '朝鲜祖国民主战线中央委员会主席金枓奉电联合国秘书长控告美帝及其忠实走狗李承晚用美式武器非法侵犯“三八”线'], 'frequency': [98, 68, 1836, 2734, 1846, 222, 796, 1006, 2066, 1194, 590]},
		{'word': '广泛', 'descriptions': ['津商会欢宴农民代表广泛交换城乡供求意见工展四五两日观众近七万人', '京市机关工厂学校灭蚤捕鼠注射防疫工作正广泛开展', '陕北延安等地广泛变工互助展开秋收运动陕北军区千余人下乡助收'], 'frequency': [208, 50, 886, 1136, 960, 78, 160, 306, 444, 376, 162]},
		{'word': '统一', 'descriptions': ['恢复发展茶叶产制外销全国茶叶会议制定明年茶业经营计划成立中国茶叶公司统一收购及外销', '统一会计制度提高金融业务全国首届银行会计会议闭幕', '会议讨论通过二十六项任命毛主席说明必须统一统一和因地制宜要互相结合'], 'frequency': [574, 92, 1650, 2766, 2204, 276, 734, 1228, 2414, 1468, 679]},
		{'word': '巩固', 'descriptions': ['伟大崇高的国际友情巩固坚定的胜利信念记中国保卫世界和平大会第二日', '为了完成胜利与巩固胜利', '巩固中苏两国邦交，发展中苏人民友谊！毛主席访苏会见斯大林大元帅'], 'frequency': [254, 58, 932, 1068, 1596, 50, 64, 196, 348, 484, 348]},
		{'word': '救灾', 'descriptions': ['河北广大城乡普遍开展节约救灾安置灾民工作正妥善进行', '沈京两足球队义赛得救灾款十一万元', '察绥指示节约救灾组织灾民生产，发动各地捐助，严格执行编制、开支规定。'], 'frequency': [144, 62, 474, 126, 128, 28, 104, 324, 1202, 2198, 422]},
		{'word': '法西斯', 'descriptions': ['雅典法西斯压榨下希腊农民生活惨苦', '伏兹尼在青年反法西斯座谈会报告苏联青年英勇斗争保卫祖国保卫和平', '吉田政府法西斯罪行封闭朝鲜侨民学校非法解雇进步教员'], 'frequency': [274, 40, 436, 798, 1150, 56, 56, 60, 90, 76, 60]},
		{'word': '工作会议', 'descriptions': ['河南经济工作会议确定方针发展贸易加强运输打开工农业产品出路', '全国新华书店出版工作会议通过统一公营出版事业方案全体代表晋谒毛主席致敬', '全国出版工作会议闭幕陆定一致闭幕词强调指出新华书店必须统一迎接新中国文化建设的高潮'], 'frequency': [60, 46, 650, 358, 94, 102, 78, 258, 972, 576, 215]},
		{'word': '出口', 'descriptions': ['华北出口转呈畅旺上旬出口物资超过上月全月总值', '华北对外贸易结汇出口增加', '花生等油料作物有销路华北油脂公司组织收购将在唐津等地设厂加工出口'], 'frequency': [174, 46, 310, 332, 398, 70, 654, 1552, 3764, 1874, 631]},
		{'word': '外交关系', 'descriptions': ['苏联政府发表声明认为与广州外交关系断绝决定自广州召回外交代表', '中苏任命首任大使苏联为罗申我国为王稼祥中罗建立外交关系罗照会我国，周部长电复热忱欢迎前国民党政府驻塔什干总领事馆人员电我外交部，表示拥护中央人民政府领导。', '中苏建立外交关系互派大使馆参事兼代办由齐赫文斯基戈宝权担任'], 'frequency': [10, 20, 158, 204, 318, 22, 72, 76, 174, 58, 35]},
		{'word': '文艺', 'descriptions': ['大众文艺工作者团结起来迎接文化建设的高潮', '赵树理等为推广大众文艺筹组创作研究会', '华东军区和第三野战军举行文艺工作会议决议展开群众性连队文艺运动'], 'frequency': [262, 84, 1138, 1506, 2030, 322, 668, 920, 1832, 1006, 631]},
		{'word': '中国人民政协', 'descriptions': ['中国人民政协代表访问记钳工郭尚义说要认真往好里干', '中国人民政协代表访问记访问左协中', '中国人民政协全国委员会举行第一次会议毛泽东当选全国委员会主席周恩来李济深沈钧儒郭沫若陈叔通当选副主席李维汉任秘书长建议中央人民政府定十月一日为中华人民共和国国庆纪念日'], 'frequency': [130, 26, 54, 0, 0, 0, 0, 0, 2, 6, 1]},
		{'word': '人民民主', 'descriptions': ['全世界一切爱好和平民主的人们紧紧团结在斯大林周围干杯！为中国人民，为中国共产党，为中国人民领袖毛泽东；为走向社会主义的各人民民主国家的人民，为各兄弟共产党，为全世界一切劳动者，为全世界一切民主力量的大团结！', '标志亚洲各国民主妇女空前大团结亚洲妇代会议在京揭幕会议将报告讨论亚洲妇女为民族独立人民民主世界和平而斗争及保护妇女儿童权利等问题', '人民民主国家进一步加强友谊与合作匈牙利朝鲜捷克波兰相继与我国建立邦交周外长分别答复表示欢迎'], 'frequency': [128, 54, 1142, 110, 38, 12, 22, 36, 40, 16, 99]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
		 // this.chartData.url=foundWord.url;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>