<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="6"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		   description:['毛主席《论十大关系》是各国人民极宝贵文献', '毛主席三个世界理论以马列主义为基础', '掀起学习马列著作和毛主席著作的新高潮'],
		   frequency:  [1260, 228, 3616, 8240, 9422, 1598, 4514, 9872, 22528, 25846, 18006],
		   word:'毛主席',
		   index:5
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 1632},{'text': '发展', 'size': 1300},{'text': '四人帮', 'size': 1184},{'text': '毛主席', 'size': 1032},{'text': '斗争', 'size': 913},{'text': '副主席', 'size': 574},{'text': '邓小平', 'size': 388},{'text': '独立', 'size': 384},{'text': '揭露', 'size': 370},{'text': '廖承志', 'size': 364},{'text': '耿飚', 'size': 352},{'text': '经济', 'size': 292},{'text': '农业', 'size': 292},{'text': '反霸', 'size': 278},{'text': '五届人大', 'size': 205},{'text': '第三世界国家', 'size': 154},{'text': '总任务', 'size': 100},{'text': '四个现代化', 'size': 94},{'text': '反革命', 'size': 90},{'text': '实事求是', 'size': 90},{'text': '建交', 'size': 86},{'text': '无产阶级', 'size': 86},{'text': '不结盟运动', 'size': 78},{'text': '武装斗争', 'size': 76},{'text': '劳动竞赛', 'size': 76},{'text': '抓纲治国', 'size': 72},{'text': '社会帝国主义', 'size': 70},{'text': '无产阶级文化', 'size': 70},{'text': '批评', 'size': 64},{'text': '团结起来', 'size': 62},{'text': '拨乱反正', 'size': 62},{'text': '技术合作', 'size': 60},{'text': '联合公报', 'size': 60},{'text': '社会主义建设', 'size': 52},{'text': '解放思想', 'size': 52},{'text': '新长征', 'size': 50},{'text': '中共十一大', 'size': 50},{'text': '欧洲经济共同体', 'size': 48},{'text': '粉碎“四人帮”', 'size': 46},{'text': '新国际经济秩序', 'size': 46},{'text': '因地制宜', 'size': 46},{'text': '鲁迅', 'size': 44},{'text': '友谊赛', 'size': 44},{'text': '《毛泽东选集》第五卷', 'size': 44},{'text': '世界革命', 'size': 42}
		],
      wordData: [
		 {'word': '人民', 'descriptions': ['尼泊尔——中国人民的友好邻邦', '索新闻和国家指导部发言人宣布全国局势恢复正常索马里人民决心维护革命和国家主权萨达特总统和尼迈里总统电贺西亚德总统粉碎政变阴谋', '第五届中国人民政治协商会议全国委员会委员陈云涛同志追悼会在京举行  谷牧副总理等参加追悼会并送了花圈'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
		 {'word': '发展', 'descriptions': ['商业要为国民经济发展争速度', '安徽省工农业生产发展，财政收入增加', '唐山矿五二五七综合机械化采煤队勇攀高峰创造月产全国最高纪录高速度发展社会主义建设'], 'frequency': [1260, 228, 3616, 8240, 9422, 1598, 4514, 9872, 22528, 25846, 18006]},
		 {'word': '四人帮', 'descriptions': ['切实整顿企业  实现增产增收平顶山矿务局紧密联系实际揭批“四人帮”，分清了路线是非。去年，煤炭生产和上缴利润都提前完成了国家计划', '‘四人帮’反对周总理激起天怨人怒', '旅新华侨赞扬《创业》怒斥“四人帮”'], 'frequency': [0, 0, 0, 0, 56, 1232, 34, 4, 0, 2, 0]},
		 {'word': '毛主席', 'descriptions': ['毛主席《论十大关系》是各国人民极宝贵文献', '毛主席三个世界理论以马列主义为基础', '掀起学习马列著作和毛主席著作的新高潮'], 'frequency': [656, 330, 2632, 2782, 17280, 1118, 130, 36, 172, 24, 4]},
		 {'word': '斗争', 'descriptions': ['广大发展中国家同超级大国展开又一轮斗争', '日本各界友好人士热烈祝贺日中条约签订日中友好的滚滚潮流任何障碍也阻挡不住日本工人党强调条约为日本人民反霸斗争奠定坚实基础', '第三世界国际经济领域的联合反霸斗争方兴未艾'], 'frequency': [1306, 206, 3872, 14932, 17940, 1080, 828, 1234, 1100, 322, 282]},
		 {'word': '副主席', 'descriptions': ['朴成哲副主席路经乌鲁木齐', '动员和组织全体民兵努力实现新时期总任务华主席叶副主席为会议题词，指出了加强民兵工作的方针和任务', '给华主席、叶副主席、党中央、中央军委的决心书'], 'frequency': [104, 76, 830, 1732, 1624, 584, 184, 528, 474, 330, 261]},
		 {'word': '邓小平', 'descriptions': ['中泰在曼谷签署贸易和科技合作文件邓小平副总理和江萨总理出席签字仪式', '邓小平副总理会见泰中友协代表团', '邓小平副总理会见里陶丁外长马来西亚外长里陶丁举行答谢宴会'], 'frequency': [0, 4, 44, 672, 1282, 392, 442, 476, 1654, 466, 37]},
		 {'word': '独立', 'descriptions': ['津巴布韦人民有自决独立的权利', '声援扎伊尔反侵略就是维护非洲独立和团结', '阿那尼·阿卡波—阿亚尼奥大使举行招待会庆祝多哥独立十八周年'], 'frequency': [302, 56, 830, 3920, 2360, 446, 542, 752, 588, 332, 155]},
		 {'word': '揭露', 'descriptions': ['索马里五万群众集会反对苏联干涉西亚德总统号召人民作好准备保卫独立和主权澳大利亚和委内瑞拉报纸揭露苏联和古巴干涉非洲之角', '波尔布特书记接见土耳其新闻界朋友民主柬埔寨电台揭露越南当局的地区霸权主义野心', '揭露史密斯的假选举阴谋'], 'frequency': [250, 24, 840, 2566, 2116, 372, 336, 224, 138, 22, 19]},
		 {'word': '廖承志', 'descriptions': ['廖承志副委员长会见日本冈山县知事一行访华团', '日社会党第八次访华团举行答谢宴会廖承志等应邀出席，飞鸟田一雄和廖承志祝酒', '廖承志会长宴请日本电影界人士'], 'frequency': [32, 0, 42, 552, 992, 368, 312, 174, 12, 12, 0]},
		 {'word': '耿飚', 'descriptions': ['前往巴基斯坦参加喀喇昆仑公路竣工典礼并进行友好访问耿飚副总理率政府代表团离京纪登奎、陈慕华副总理等到机场欢送', '阿梅杜梅海军少将和夫人举行宴会  耿飚副总理和阿梅杜梅少将继续会谈', '萨莫拉总统率代表团离沪去匈牙利耿飚副总理等在北京送行'], 'frequency': [0, 0, 10, 34, 526, 352, 254, 142, 10, 16, 1]},
		 {'word': '经济', 'descriptions': ['日本四经济团体酒会欢迎我经济代表团', '是“经济合作”还是养虎贻患', '王震副总理会见日本北海道经济联合会代表团'], 'frequency': [1070, 404, 3848, 6404, 5490, 1204, 4386, 11166, 20014, 12938, 8012]},
		 {'word': '农业', 'descriptions': ['农林部举办农业全盘机械化试点县干部训练班', '大蔡庄大队农业科学试验队防治花生枯萎病获初步成果', '做农业机械化大干快上的促进派'], 'frequency': [594, 116, 5546, 8704, 4686, 896, 1650, 2376, 6552, 3416, 1837]},
		 {'word': '反霸', 'descriptions': ['世界反帝反殖反霸力量迅速发展壮大', '日本报刊新年伊始呼吁加强反霸斗争排除干扰早日缔结日中和平友好条约强调结成反对苏联霸权主义的广泛的统一战线', '比利时马列共和意大利统一共发表联合公报支持三个世界理论  加强团结反霸斗争'], 'frequency': [0, 0, 12, 0, 324, 282, 68, 8, 2, 2, 0]},
		 {'word': '五届人大', 'descriptions': ['贵州省五届人大首次会议在贵阳举行', '喀麦隆总统阿希乔的贺电热烈祝贺五届人大首次会议圆满成功', '攀登在群山之巅——记五届人大代表、工程热物理学家吴仲华'], 'frequency': [0, 0, 0, 0, 0, 226, 170, 44, 0, 0, 0]},
		 {'word': '第三世界国家', 'descriptions': ['反对帝国主义侵略政策和战争政策  支持第三世界国家和人民正义事业朝鲜对外关系不断发展国际地位日益提高', '一些第三世界国家积极发展经济作物生产', '一些第三世界国家发展民族工业取得成绩'], 'frequency': [0, 0, 0, 0, 476, 158, 56, 78, 24, 2, 0]},
		 {'word': '总任务', 'descriptions': ['上棉二十二厂职工为加快实现四个现代化响亮提出“一天要当两天用”认真学习五届人大文件努力实现新时期总任务', '大庆组织宣讲团深入井队职工们深入学习进一步明确奋斗目标认真学习五届人大文件努力实现新时期总任务', '发扬我军优良传统为实现新时期总任务作贡献驻沪空军某部提前让出营房支援宝钢'], 'frequency': [2, 2, 22, 6, 0, 100, 8, 24, 4, 0, 3]},
		 {'word': '四个现代化', 'descriptions': ['揭批“四人帮”和实现四个现代化新时期总任务讲座', '商业要跟上四个现代化的步伐', '四个现代化是巩固无产阶级专政的需要'], 'frequency': [0, 0, 0, 0, 10, 94, 44, 14, 0, 2, 0]},
		 {'word': '反革命', 'descriptions': ['一个反革命的政治骗局', '“四人帮”是复辟资本主义的反革命分子', '新闻战线上的革命和反革命'], 'frequency': [28, 6, 1232, 678, 1192, 108, 98, 30, 68, 0, 0]},
		 {'word': '实事求是', 'descriptions': ['实事求是不图虚名', '华主席和党中央、中央军委领导同志再次出席全军政工会议邓副主席精辟阐述毛主席实事求是光辉思想', '珍贵的石匾实事求是'], 'frequency': [8, 2, 26, 118, 44, 92, 150, 152, 206, 74, 41]},
		 {'word': '建交', 'descriptions': ['庆祝尼日尔国庆和尼中建交三周年', '我驻圭亚那使馆为中圭建交五周年举行宴会', '祝贺我国同利比里亚建交'], 'frequency': [0, 0, 134, 440, 584, 86, 322, 570, 1180, 886, 385]},
		 {'word': '无产阶级', 'descriptions': ['德国共产党和意大利统一共产党发表联合声明三个世界理论是国际斗争中无产阶级的阶级路线', '华主席在全国财贸“双学”会上作重要讲话讲话指出，在当前大好形势下丝毫不能自满。用大庆大寨精神办好财贸事业，就是要求在财贸工作中，以无产阶级专政下继续革命的伟大理论为指导，全面落实发展经济、保障供给的方针，坚持贯彻马克思主义的政治观点、生产观点和群众观点。讲话强调，要通过学习和实践，提高对社会主义经济规律的认识和运用经济规律的自觉性，提高经济工作的管理水平，提高现代科学技术水平。叶剑英副主席主持大会  邓小平李先念副主席等党和国家领导人出席', '世界上第一张无产阶级报纸——《新莱茵报》'], 'frequency': [26, 2, 60, 308, 5062, 220, 74, 36, 12, 10, 3]},
		 {'word': '不结盟运动', 'descriptions': ['朝鲜党和政府联席会议阐述对不结盟运动的立场不结盟国家坚持团结反帝反殖反支配主义', '扎伊尔和索马里外长在不结盟外长会议上发言谴责古巴为苏联效劳破坏不结盟运动古巴外长为苏古侵略干涉非洲进行徒劳的辩解', '华主席在铁托总统欢迎宴会上讲话表示坚决支持南为维护不结盟运动团结、坚持它的根本方向所进行的斗争'], 'frequency': [0, 0, 0, 0, 56, 84, 108, 102, 88, 24, 6]},
		 {'word': '武装斗争', 'descriptions': ['武装斗争是解放南非的主要战略', '坚持武装斗争解放被占领土', '支持纳米比亚人民争取民族独立的武装斗争'], 'frequency': [24, 6, 24, 508, 1838, 76, 26, 44, 14, 4, 0]},
		 {'word': '劳动竞赛', 'descriptions': ['上海保温瓶行业开展劳动竞赛  消耗降低  产量大增', '丰林林业局广大职工团结协作劳动竞赛热火朝天', '全国煤炭战线社会主义劳动竞赛热火朝天'], 'frequency': [20, 8, 268, 248, 86, 76, 10, 14, 20, 16, 3]},
		 {'word': '抓纲治国', 'descriptions': ['一切服从抓纲治国的战略决策', '全国亿万军民满怀抓纲治国信心庆“五一”', '抓纲治国  搞好春耕'], 'frequency': [0, 0, 0, 0, 0, 72, 0, 0, 0, 0, 0]},
		 {'word': '社会帝国主义', 'descriptions': ['警惕苏联社会帝国主义加紧战争准备', '谴责社会帝国主义策划雇佣军入侵扎伊尔坚信扎伊尔人民的反侵略斗争必将取得最后的胜利', '扎伊尔事件再次暴露苏联社会帝国主义狰狞面目'], 'frequency': [0, 0, 0, 0, 464, 70, 10, 0, 0, 0, 0]},
		 {'word': '无产阶级文化', 'descriptions': ['我国伟大的无产阶级文化战士郭沫若同志逝世郭沫若同志病重期间，华主席以及党和国家其他领导人到医院看望', '马尔科维奇主席的唁电沉痛哀悼卓越的无产阶级文化战士郭沫若同志逝世', '沙邦—戴尔马议长的唁电沉痛哀悼卓越的无产阶级文化战士郭沫若同志逝世'], 'frequency': [2, 0, 0, 2, 990, 76, 0, 2, 2, 0, 0]},
		 {'word': '批评', 'descriptions': ['一封批评信的处理经过', '共产党员要认真开展批评和自我批评', '美总统研究备忘录鼓吹向苏输出技术遭到批评'], 'frequency': [238, 24, 1954, 526, 330, 82, 520, 1074, 1136, 500, 241]},
		 {'word': '团结起来', 'descriptions': ['南朝鲜统一革命党和各界人士等发出呼吁团结起来反对伪选打倒朴正熙法西斯政权', '努力打好第三战役  夺取运动科研全胜七机部召开万人大会，拥护公安部门依法逮捕“四人帮”死党、现行反革命分子舒龙山。宋任穷部长号召全体干部和群众团结起来，三大革命一起抓', '瑞典共产党谴责苏联核潜艇进驻波罗的海号召团结起来反对苏联的战争政策芬兰报纸揭露苏联空谈“缓和”实则加剧紧张局势'], 'frequency': [46, 10, 174, 416, 636, 64, 60, 42, 18, 12, 8]},
		 {'word': '拨乱反正', 'descriptions': ['拨乱反正必须解放思想', '山南地委领导干部深入调查研究带头拨乱反正坚决废除“土政策”  社员大干有劲头', '拨乱反正  正本清源  肃清流毒理论工作者要在揭批“四人帮”第三战役中发挥更大作用中共甘肃省委召开理论工作座谈会。宋平同志针对目前思想理论战线情况发表讲话'], 'frequency': [0, 0, 0, 0, 0, 62, 8, 2, 8, 0, 1]},
		 {'word': '技术合作', 'descriptions': ['西亚德总统表示要同西德加强合作索马里分别同西德和南斯拉夫签订经济技术合作协定', '纪登奎副总理会见朝鲜科学技术合作代表团', '陈慕华副总理会见马勒博士卫生部和世界卫生组织关于卫生技术合作备忘录签字'], 'frequency': [2, 0, 122, 240, 276, 88, 92, 344, 236, 62, 20]},
		 {'word': '联合公报', 'descriptions': ['朝鲜和南斯拉夫发表联合公报', '古巴是苏联军事干涉非洲的急先锋索马里代表在裁军特别联大上驳斥古巴代表的谰言法国和沙特阿拉伯联合公报主张非洲不受外来干涉', '刚果党和国家代表团结束对朝鲜访问双方发表联合公报强调支持各国人民反帝反殖斗争'], 'frequency': [2, 0, 150, 550, 756, 62, 54, 44, 212, 204, 64]},
		 {'word': '社会主义建设', 'descriptions': ['南斯拉夫社会主义建设取得显著成就广大青少年参加义务劳动以优异成绩向南共联盟十一大献礼', '进一步加强国家法制，保障社会主义建设事业一九五六年九月十九日在中国共产党第八次全国代表大会上的发言', '机械工业战线首季月月创高产高速度发展社会主义建设'], 'frequency': [6, 0, 216, 648, 514, 54, 38, 62, 56, 24, 21]},
		 {'word': '解放思想', 'descriptions': ['坚持理论联系实际  扫除障碍解放思想彭冲同志谈马列主义、毛泽东思想体系是指导我们思想的理论基础', '一切从实际出发  加速现代化步伐湖北省委第一书记陈丕显在全省理论工作会议上说，解放思想，破除迷信，实事求是，尊重科学，已经成为时代的要求', '解放思想，大胆研究新情况，解决新问题曾思玉肖望东同志强调：坚持实践是检验真理的唯一标准就能发挥人的创造性吴克华孔石泉同志强调：打碎林彪、“四人帮”的精神枷锁，坚持实事求是，加速部队建设'], 'frequency': [0, 0, 0, 32, 38, 52, 112, 72, 222, 172, 39]},
		 {'word': '新长征', 'descriptions': ['让人们省下时间用到新长征中去——记上海汉阳路上深受群众欢迎的商业和街道服务工作', '全国各族人民举行盛大游行欢庆五届人大胜利闭幕紧跟华主席为祖国现代化开始新长征', '张玉凤争分夺秒多织布新长征中的纺织工业劳模'], 'frequency': [0, 0, 0, 0, 0, 62, 106, 30, 34, 24, 30]},
		 {'word': '中共十一大', 'descriptions': ['中共十一大高举毛泽东思想的伟大旗帜', '中共十一大标志中国社会主义革命和建设进入新阶段', '中共十一大对国际无产阶级和世界人民具有重大意义'], 'frequency': [0, 0, 0, 0, 0, 50, 0, 0, 0, 0, 0]},
		 {'word': '欧洲经济共同体', 'descriptions': ['欧洲经济共同体九国外长讨论发展计划反对外来势力干涉非洲之角局势对萨达特总统解决中东问题的主动性表示欣赏', '欧洲议会一致同意欧洲经济共同体同中国的贸易协定', '欧洲经济共同体外长会议对非洲形势关切'], 'frequency': [0, 0, 0, 0, 76, 56, 34, 32, 0, 0, 0]},
		 {'word': '粉碎“四人帮”', 'descriptions': ['赞扬华主席粉碎“四人帮”，为中国革命建立功勋', '外国朋友悼念毛主席欢庆我国粉碎“四人帮”', '粉碎“四人帮”保证中国永不变色'], 'frequency': [0, 0, 0, 0, 6, 62, 0, 0, 0, 2, 0]},
		 {'word': '新国际经济秩序', 'descriptions': ['第三世界国家为建立新国际经济秩序而斗争', '加强发展中国家团结争取建立新国际经济秩序', '谴责超级大国剥削呼吁建立新国际经济秩序'], 'frequency': [0, 0, 0, 0, 96, 48, 4, 10, 0, 0, 0]},
		 {'word': '因地制宜', 'descriptions': ['因地制宜  讲求实效泗阳县委倾听群众意见扎扎实实治农田', '因地制宜退耕种草  加速发展畜牧业沽源种牛场正确处理农牧关系，粮食增产，牲畜增加', '落实经济政策  坚持因地制宜食糖生产创历史最高水平'], 'frequency': [0, 2, 18, 400, 116, 46, 148, 66, 126, 94, 83]},
		 {'word': '鲁迅', 'descriptions': ['鲁迅展览会在日本神户开幕', '鲁迅对求全责备的批判', '日本仙台市友好人士纪念鲁迅逝世四十一周年'], 'frequency': [24, 50, 266, 194, 168, 60, 338, 244, 284, 160, 39]},
		 {'word': '友谊赛', 'descriptions': ['中国象棋队在港澳进行友谊赛和表演赛', '日本高中足球队同北京中学生足球队在京进行友谊赛', '中塞两国男子篮球队在京进行友谊赛'], 'frequency': [0, 0, 72, 618, 606, 48, 20, 48, 70, 24, 14]},
		 {'word': '《毛泽东选集》第五卷', 'descriptions': ['《毛泽东选集》第五卷少数民族文版出版', '《毛泽东选集》第五卷首批发行两千八百万册', '中共中央关于学习《毛泽东选集》第五卷的决定'], 'frequency': [0, 0, 0, 0, 0, 122, 0, 0, 0, 0, 0]},
		 {'word': '世界革命', 'descriptions': ['周总理执行毛主席路线对中国和世界革命贡献巨大', '毛主席永远活在世界革命人民心中', '中国日益成为世界革命的可靠根据地'], 'frequency': [2, 0, 0, 74, 860, 46, 0, 0, 0, 0, 0]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>