<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="9"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		   description:   ['江泽民主席应约与布什总统通电话', '江泽民会见加利', '江泽民主席会见克劳斯总理'],
		   frequency:[0, 0, 0, 0, 0, 0, 0, 12, 5494, 522, 37],
		   word:'江泽民',
		   index:8
	   },
      clickedWord: '',
	words2 :[
		{'text': '江泽民', 'size': 5445},{'text': '市场', 'size': 5283},{'text': '香港', 'size': 3812},{'text': '教育', 'size': 2880},{'text': '农业', 'size': 2584},{'text': '研制', 'size': 2470},{'text': '朱镕基', 'size': 2284},{'text': '出口', 'size': 2083},{'text': '天津', 'size': 2032},{'text': '文化', 'size': 2024},{'text': '南非', 'size': 1982},{'text': '澳门', 'size': 1786},{'text': '北约', 'size': 1654},{'text': '统一', 'size': 1650},{'text': '李岚清', 'size': 1527},{'text': '新疆', 'size': 1425},{'text': '扶贫', 'size': 1414},{'text': '中东', 'size': 1264},{'text': '三个代表', 'size': 808},{'text': '香港回归', 'size': 620},{'text': '澳门回归', 'size': 286},{'text': '信息产业', 'size': 148},{'text': '科教兴国', 'size': 148},{'text': '农业综合开发', 'size': 146},{'text': '军民共建', 'size': 144},{'text': '文化建设', 'size': 140},{'text': '“三个代表”重要思想', 'size': 138},{'text': '出口创汇', 'size': 136},{'text': '股份制', 'size': 136},{'text': '高效农业', 'size': 136},{'text': '两手抓', 'size': 132},{'text': '外向型经济', 'size': 130},{'text': '因地制宜', 'size': 126},{'text': '生态农业', 'size': 122},{'text': '扩大内需', 'size': 118},{'text': '自由贸易区', 'size': 112},{'text': '先进文化', 'size': 112},{'text': '义务教育', 'size': 107},{'text': '经济特区', 'size': 104},{'text': '生力军', 'size': 104},{'text': '科技发展', 'size': 102},{'text': '艺术团', 'size': 100},{'text': '为人民服务', 'size': 100},{'text': '特色农业', 'size': 100}
		],
      wordData: [
	{'word': '江泽民', 'descriptions': ['江泽民主席应约与布什总统通电话', '江泽民会见加利', '江泽民主席会见克劳斯总理'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 12, 5494, 522, 37]},
	{'word': '市场', 'descriptions': ['合肥荣事达洗衣机畅销市场', '期货市场的“呼”与“应”', '速溶维他花生豆奶粉投放市场'], 'frequency': [230, 16, 630, 962, 454, 38, 782, 3132, 12696, 5090, 2969]},
	{'word': '香港', 'descriptions': ['香港特区第二届立法会举行首次会议', '香港基本法不容外国干涉  英方应立即停止粗暴指责', '香港筹备第二十七届艺术节'], 'frequency': [86, 18, 698, 488, 552, 88, 392, 2120, 6808, 2970, 1712]},
	{'word': '教育', 'descriptions': ['南疆军区某部进行艰苦奋斗教育', '教育部负责人介绍教育改革和发展情况', '发展迅速的扎伊尔教育'], 'frequency': [882, 220, 2926, 3878, 5780, 452, 1640, 4384, 9184, 7122, 3530]},
	{'word': '农业', 'descriptions': ['赞比亚举办农业商贸展销会', '黄河三角洲农业开发初具规模', '密云县建立农业动态监测系统'], 'frequency': [594, 116, 5546, 8704, 4686, 896, 1650, 2376, 6552, 3416, 1837]},
	{'word': '研制', 'descriptions': ['菲丁生产新工艺研制成功', '可控降解塑料研制成功', '美研制出图像压缩新技术'], 'frequency': [0, 0, 0, 4, 48, 40, 300, 1264, 2502, 398, 126]},
	{'word': '朱镕基', 'descriptions': ['朱镕基会见丹麦企业界人士', '朱镕基在多伦多发表演说', '朱镕基会见德国副总理兼外长菲舍尔'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 2298, 118, 3]},
	{'word': '出口', 'descriptions': ['浙江机械设备进出口效益大增', '埃塞俄比亚增加咖啡出口', '农行为乡镇企业扩大出口再增投入'], 'frequency': [174, 46, 310, 332, 398, 70, 654, 1552, 3764, 1874, 631]},
	{'word': '天津', 'descriptions': ['天津街头新『报林』', '天津：公安机关收缴非法枪支', '从北京人到天津办婚宴说起'], 'frequency': [438, 146, 2134, 1828, 1510, 134, 854, 1610, 3334, 1746, 735]},
	{'word': '文化', 'descriptions': ['深圳渴望文化大师', '珍爱历史文化', '河北大力治理整顿文化市场'], 'frequency': [408, 236, 3560, 4290, 4800, 346, 964, 2356, 7236, 11138, 6297]},
	{'word': '南非', 'descriptions': ['南非国际调解宣告失败', '马来西亚南非组成世妇会代表团', '南非没有解散从事暴力的机构'], 'frequency': [6, 0, 108, 836, 582, 116, 460, 2274, 2404, 838, 439]},
	{'word': '澳门', 'descriptions': ['澳门木屋居民一九九二年可获安置', '全球华人华侨共庆澳门回归', '新华社澳门分社举行新春酒会'], 'frequency': [0, 4, 96, 60, 86, 2, 24, 414, 3166, 1204, 534]},
	{'word': '北约', 'descriptions': ['北约的一次战略大调整', '文学艺术界强烈谴责北约暴行', '北约主张政治解决前南危机'], 'frequency': [0, 0, 0, 0, 16, 72, 354, 394, 1872, 574, 119]},
	{'word': '统一', 'descriptions': ['人行将对金融机构经营本外币业务统一发放许可证', '李仲树为“和平统一基金”捐款', '中石化统一润滑油商标'], 'frequency': [574, 92, 1650, 2766, 2204, 276, 734, 1228, 2414, 1468, 679]},
	{'word': '李岚清', 'descriptions': ['巴林埃米尔会见李岚清', '李岚清会见参加台资企业技术产品博览会台商', '李岚清在达沃斯中国经济讨论会上发表讲话'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 1538, 114, 2]},
	{'word': '新疆', 'descriptions': ['新疆开发多文种图文排版系统', '新疆一季度经济快速增长', '新疆紧急部署防火安全工作'], 'frequency': [38, 46, 1106, 1252, 498, 100, 484, 1054, 2096, 1974, 890]},
	{'word': '扶贫', 'descriptions': ['“蘑菇大王”和“扶贫学校”', '新疆教育扶贫惠及百万学生', '水利部三峡地区扶贫见实效'], 'frequency': [0, 0, 0, 0, 0, 0, 20, 468, 2330, 970, 1814]},
	{'word': '中东', 'descriptions': ['中东北非经济会议闭幕', '埃叙复交与中东局势', '实现中东和平不能排除耶路撒冷问题'], 'frequency': [42, 6, 258, 760, 792, 120, 432, 828, 1650, 806, 500]},
	{'word': '三个代表', 'descriptions': ['《农村干部学习“三个代表”重要思想文件汇编》出版', '以“三个代表”为指导搞好机构改革', '全国青年学习“三个代表”重要思想座谈会举行'], 'frequency': [0, 0, 4, 30, 12, 0, 0, 2, 1236, 784, 0]},
	{'word': '香港回归', 'descriptions': ['在欧洲感受香港回归', '全国政协举行迎接香港回归座谈会', '塞总统祝贺香港回归'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 540, 74, 36]},
	{'word': '澳门回归', 'descriptions': ['九三学社举行庆澳门回归座谈会', '“庆祝澳门回归”', '各国政要盛赞澳门回归'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 354, 48, 16]},
	{'word': '信息产业', 'descriptions': ['我信息产业核心技术获重要进展', 'TCL涉足电子信息产业', '加快发展高技术信息产业'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 16, 216, 124, 19]},
	{'word': '科教兴国', 'descriptions': ['积极投身科教兴国伟业', '科教兴国与国兴科教', '要为实施科教兴国战略作更大贡献'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 236, 44, 4]},
	{'word': '农业综合开发', 'descriptions': ['重视农业综合开发中的问题', '把农业综合开发推向新水平', '我国农业综合开发坚持水利先行'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 178, 32, 6]},
	{'word': '军民共建', 'descriptions': ['表彰２３１对军民共建先进单位', '台州军民共建“互助组”', '全国四万军民共建点发挥作用'], 'frequency': [0, 0, 0, 0, 0, 0, 8, 156, 146, 12, 2]},
	{'word': '文化建设', 'descriptions': ['以先进文化引领城市文化建设', '空军指挥学院加强军营文化建设', '企业文化建设的几个热点问题'], 'frequency': [10, 18, 114, 24, 4, 6, 4, 44, 236, 522, 135]},
	{'word': '“三个代表”重要思想', 'descriptions': ['深入贯彻“三个代表”重要思想 努力开创新时期妇女儿童工作新局面', '把深入研究阐述“三个代表”重要思想作为崇高责任', '纪念江总书记“三个代表”重要思想发表一周年研讨会在广东茂名举行'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 278, 642, 0]},
	{'word': '出口创汇', 'descriptions': ['青岛提前１１２天完成全年出口创汇任务', '荆门中行助企业出口创汇', '河北省外贸企业出口创汇多'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 108, 140, 8, 1]},
	{'word': '股份制', 'descriptions': ['光大银行将实行股份制改组', '变味的『股份制』', '中港律师合办股份制研讨会'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 78, 252, 42, 4]},
	{'word': '高效农业', 'descriptions': ['芮城向高效农业迈进', '芮城向高效农业迈进', '保定将建高效农业开发区'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 154, 18, 10]},
	{'word': '两手抓', 'descriptions': ['始终坚持两手抓的方针促进经济建设改革开放', '坚持“两手抓”的理论，进一步繁荣新闻出版事业', '坚定不移两手抓'], 'frequency': [0, 0, 0, 14, 0, 0, 0, 10, 132, 92, 33]},
	{'word': '外向型经济', 'descriptions': ['舟山市发展外向型经济的优势和对策', '华鑫集团外向型经济发展迅速', '山东中行在外向型经济发展中大显身手'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 122, 134, 2, 3]},
	{'word': '因地制宜', 'descriptions': ['义马因地制宜调整农业结构', '因地制宜贵在扬长', '湖南：因地制宜抓开课'], 'frequency': [0, 2, 18, 400, 116, 46, 148, 66, 126, 94, 83]},
	{'word': '生态农业', 'descriptions': ['开创生态农业新纪元', '生态农业带来瑶乡富', '朱湖水体生态农业研究成效显著'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 22, 142, 48, 28]},
	{'word': '扩大内需', 'descriptions': ['为扩大内需优化经济结构出力', '怎样理解坚持扩大内需就是坚持“发展是硬道理”', '西北扩大内需有潜力'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 2, 120, 146, 33]},
	{'word': '自由贸易区', 'descriptions': ['保捷斯３国商建自由贸易区', '哈准备建立国际自由贸易区', '将加速建设自由贸易区'], 'frequency': [0, 0, 2, 8, 20, 0, 4, 14, 152, 46, 12]},
	{'word': '先进文化', 'descriptions': ['时代洪流中的先进文化', '光明网：增强先进文化感召力', '弘扬先进文化多出精品力作'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 112, 220, 12]},
	{'word': '义务教育', 'descriptions': ['国家教委部署贯彻《义务教育法实施细则》', '各级政府要狠抓普及义务教育', '义务教育阶段不允许高收费'], 'frequency': [0, 0, 18, 10, 4, 0, 0, 92, 148, 388, 125]},
	{'word': '经济特区', 'descriptions': ['来自经济特区的理论思考', '波兰第一个经济特区开始运营', '关于加强经济特区建设的若干看法'], 'frequency': [0, 0, 0, 0, 0, 0, 20, 110, 134, 80, 29]},
	{'word': '生力军', 'descriptions': ['子弟兵成为精神文明建设生力军', '大城县民兵担当致富生力军', '青年是科教兴农生力军'], 'frequency': [0, 0, 10, 74, 44, 6, 4, 36, 106, 62, 49]},
	{'word': '科技发展', 'descriptions': ['北京个人车辆纳税收入用于科技发展', '发挥首都优势加速科技发展', '科技发展与体能低下'], 'frequency': [0, 0, 0, 4, 4, 6, 8, 90, 170, 76, 44]},
	{'word': '艺术团', 'descriptions': ['广西艺术团在赞比亚获好评', '空军蓝天幼儿艺术团享誉海内外', '香港桂林合资艺术团成立'], 'frequency': [0, 0, 430, 614, 380, 62, 36, 196, 496, 146, 36]},
	{'word': '为人民服务', 'descriptions': ['为人民服务是无限的', '真心实意地为人民服务', '市场经济也要提倡为人民服务'], 'frequency': [28, 4, 42, 114, 324, 18, 32, 48, 120, 62, 31]},
	{'word': '特色农业', 'descriptions': ['找准当地优势  发展特色农业', '特色农业“花”正红', '发展特色农业推动产业化进程'], 'frequency': [0, 0, 0, 0, 0, 0, 0, 0, 102, 74, 34]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>