<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="5"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		  description:   ['越南南方和柬埔寨人民武装英勇打击敌人    平定省歼敌六百余包括尉级和校级军官四十多     唝吥、茶胶两省十天歼灭敌人两千六百多名', '葵花山下向阳花——记人民解放军总后勤部牡丹江军马场十姐妹放牧班', '黎巴嫩各地学生在贝鲁特举行集会支持巴勒斯坦人民武装斗争'],
		  frequency: [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245],
		  word:'人民',
		  index:4
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 25357},{'text': '革命', 'size': 21511},{'text': '毛主席', 'size': 16031},{'text': '谴责', 'size': 7536},{'text': '抗议', 'size': 3348},{'text': '文化大革命', 'size': 3115},{'text': '敌人', 'size': 3092},{'text': '无产阶级', 'size': 2937},{'text': '阴谋', 'size': 2830},{'text': '反动', 'size': 2682},{'text': '贫下中农', 'size': 2433},{'text': '批判', 'size': 2117},{'text': '镇压', 'size': 1754},{'text': '大批判', 'size': 1738},{'text': '革命化', 'size': 1660},{'text': '阶级斗争', 'size': 1626},{'text': '粉碎', 'size': 1624},{'text': '自由', 'size': 250},{'text': '安理会', 'size': 249},{'text': '政变', 'size': 246},{'text': '国家主权', 'size': 242},{'text': '严重警告', 'size': 224},{'text': '一元化领导', 'size': 222},{'text': '保卫祖国', 'size': 220},{'text': '中央', 'size': 219},{'text': '选举', 'size': 218},{'text': '《毛主席语录》', 'size': 218},{'text': '颠覆', 'size': 212},{'text': '诬蔑', 'size': 210},{'text': '觉醒', 'size': 208},{'text': '首都革命', 'size': 208},{'text': '扩军备战', 'size': 206},{'text': '野心', 'size': 202},{'text': '重创', 'size': 200},{'text': '内政', 'size': 200},{'text': '基层', 'size': 200},{'text': '斗志昂扬', 'size': 200},{'text': '纸老虎', 'size': 196},{'text': '武元甲', 'size': 194},{'text': '不畏强暴', 'size': 194},{'text': '中国无产阶级', 'size': 192},{'text': '《团结报》', 'size': 190},{'text': '民族解放运动', 'size': 187},{'text': '核试验', 'size': 186},{'text': '反美示威', 'size': 183}
		],
      wordData: [
		{'word': '人民', 'descriptions': ['越南南方和柬埔寨人民武装英勇打击敌人    平定省歼敌六百余包括尉级和校级军官四十多     唝吥、茶胶两省十天歼灭敌人两千六百多名', '葵花山下向阳花——记人民解放军总后勤部牡丹江军马场十姐妹放牧班', '黎巴嫩各地学生在贝鲁特举行集会支持巴勒斯坦人民武装斗争'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
		{'word': '革命', 'descriptions': ['为革命掌握司锤技术', '霍查同志在地拉那选民会见会上发表讲话加强无产阶级专政深入开展思想文化革命高举反帝反修旗帜支持各国人民解放斗争', '要活命就要反抗  敢斗争就能胜利印度今年来一千多万人奋起参加反政府斗争用革命暴力反对反革命暴力  印度反动派吓得胆颤心惊'], 'frequency': [576, 240, 3054, 11384, 37930, 1348, 1162, 1244, 1484, 1056, 733]},
		{'word': '毛主席', 'descriptions': ['狠斗私心围剿派性全面落实毛主席最新指示广州首届工代会胜利召开', '全国工人阶级和各族劳动人民欢庆“五一”国际劳动节    热烈欢呼国内国际一派大好革命形势    决心沿着毛主席的革命路线胜利前进', '用毛主席的干部政策武装群众热情帮助犯错误干部提高觉悟宣化工程机械厂革委会和广大群众，在解放军帮助下，认真作好解放干部的工作，更加孤立了一小撮阶级敌人，有力地推动了全厂斗批改'], 'frequency': [656, 330, 2632, 2782, 17280, 1118, 130, 36, 172, 24, 4]},
		{'word': '谴责', 'descriptions': ['越外交部发言人谴责美帝袭击北方', '越南外交部发言人发表声明  强烈谴责美机袭击永灵区', '朝鲜外务省发表声明    强烈谴责美帝进一步扩大侵越战争'], 'frequency': [136, 32, 790, 7078, 8004, 588, 972, 1438, 1654, 608, 253]},
		{'word': '抗议', 'descriptions': ['我使馆强烈抗议缅甸反动政府无理驱逐和迫害我新华社工作人员缅甸反动派追随美苏反华必遭惨败新华社总社决定调回分社人员；缅甸政府必须保证他们离境前的安全', '首都革命群众的抗议怒潮冲向印尼大使馆印尼反动政府决没有好下场', '抗议尼克松政府扩大侵越战争疯狂扩军备战美国人民再次掀起全国规模大示威'], 'frequency': [940, 146, 3402, 5168, 3382, 138, 456, 594, 762, 262, 154]},
		{'word': '文化大革命', 'descriptions': ['文化大革命就是搞阶级斗争', '中共中央军委向全军指战员发出通知遵照伟大领袖毛主席教导开展拥政爱民活动加强军政军民团结夺取文化大革命全面胜利', '坦桑尼亚朋友赞扬中国文化大革命文化大革命一定会取得完全胜利'], 'frequency': [0, 0, 0, 8, 3176, 8, 10, 4, 2, 0, 0]},
		{'word': '敌人', 'descriptions': ['挫败敌人对解放区发动的“扫荡”和“蚕食”进攻    老挝爱国军民主动出击取得新战果    去年十二月份歼敌八百多，击落美国强盗飞机七架', '警惕阶级敌人破坏养猪事业龚寨生产队狠抓阶级斗争，促进了养猪事业大发展，现在，平均每户养猪十头，每人两头', '柬爱国军民在金边等地区战果辉煌去年歼灭敌人九万多，击落烧毁和击伤敌机一百二十一架在人民武装攻势下，朗诺卖国政权控制的金边和附近地区一片混乱'], 'frequency': [250, 12, 462, 1724, 3840, 70, 90, 72, 24, 14, 11]},
		{'word': '无产阶级', 'descriptions': ['必须坚持无产阶级的革命专政——学习《哥达纲领批判》的收获', '不怕天  不怕地  不怕妖  不怕怪不愧是无产阶级的革命知识分子', '学习无产阶级专政理论运动不容破坏'], 'frequency': [26, 2, 60, 308, 5062, 220, 74, 36, 12, 10, 3]},
		{'word': '阴谋', 'descriptions': ['揭露刘少奇开放证券交易所的阴谋', '保卫四清运动成果，掌握斗争大方向华漕公社建设大队革命农民揭穿一小撮坏家伙挑动群众揪工作队员的新阴谋，迎头痛击敌人的新反扑', '阿《人民之声报》为纪念战胜法西斯二十三周年发表文章指出美帝苏修反革命同盟是世界革命人民的大敌号召各国人民保持警惕，加强斗争，粉碎美帝苏修一切阴谋'], 'frequency': [784, 114, 2014, 4706, 3114, 190, 164, 110, 96, 30, 13]},
		{'word': '反动', 'descriptions': ['日中友好运动领导人黑田寿男发表谈话热烈支持毛主席的庄严声明日中两国人民一定能够粉碎美日反动派的侵略阴谋', '美帝和沙特阿拉伯反动派企图再度进犯也门也门人民定将挫败敌人的一切阴谋', '美帝的帮凶走狗加紧勾结苏修印度反动派鬼鬼崇崇策划反华新阴谋'], 'frequency': [1170, 120, 1128, 2142, 6060, 96, 16, 12, 36, 2, 1]},
		{'word': '贫下中农', 'descriptions': ['帮助知识青年在毛泽东思想哺育下成长安徽宿县专区各级革委会和贫下中农深入细致地对知识青年进行再教育，做到在思想上有人抓，在生产上有人教，在生活上有人管', '公路建设战线职工和筑路的贫下中农坚持抓革命促生产全国渣油路面铺筑任务完成得又快又好', '千家万户摆战场狠批叛徒刘少奇浮洋公社贫下中农以两条路线斗争为纲，开展革命大批判，收到很大效果'], 'frequency': [0, 0, 0, 154, 2482, 20, 0, 0, 0, 0, 0]},
		{'word': '批判', 'descriptions': ['用马列主义、毛泽东思想深入批林批孔“毛泽东号”机车组工人重新学习《共产党宣言》和毛主席在文化大革命中的一系列重要指示，批判“克己复礼”反动纲领，进一步提高了反修防修和继续革命的自觉性', '西安煤矿机械厂批判刘少奇一类骗子“英雄创造历史”谬论依靠工人阶级实现高产优质低消耗党委领导干部坚持参加劳动，集中群众智慧，迎着困难上。工人们说：“有困难我们克服，完成国家计划只能超不能减！”', '“物质刺激”是在铜钱眼里鼓“干劲”——包秀英家庭批判会发言摘要'], 'frequency': [58, 4, 350, 558, 4156, 164, 66, 44, 92, 22, 17]},
		{'word': '镇压', 'descriptions': ['西欧青年学生英勇展开反美反暴政斗争西班牙学生反法西斯斗争怒火迅速蔓延全国西德青年示威反对美帝侵越比利时学生奋起抗暴反对镇压学生运动', '美国黑人在底特律拿起武器造反架起机枪愤怒扫射法西斯军警  穷苦白人同黑人并肩战斗约翰逊大为惊慌出动万余军警镇压不了又赶忙增派五千空降部队', '美国进步学生运动继续发展旧金山学院学生示威抗议镇压  华盛顿大学学生集会反对军训'], 'frequency': [170, 18, 506, 1616, 1756, 54, 110, 154, 52, 2, 1]},
		{'word': '大批判', 'descriptions': ['峰峰矿区青年粮站革命群众开展革命大批判不断提高觉悟改革不合理规章制度热情为工农兵服务', '文科大学一定要搞革命大批判', '五只滚筒的启示分析好大有益——杭州市街头革命大批判专栏文章选登'], 'frequency': [0, 0, 0, 0, 1918, 2, 0, 4, 2, 0, 0]},
		{'word': '革命化', 'descriptions': ['革委会成员怎样抓好自身思想革命化？绛县的做法是：深入基层从群众中吸取政治营养', '过一个革命化的春节', '思想革命化运动结出丰硕成果  今年工农业生产大规模增长阿人民议会胜利举行第四次会议霍查列希谢胡等同志出席会议  托斯卡代表部长会议作报告'], 'frequency': [0, 0, 0, 378, 1676, 44, 2, 18, 18, 8, 1]},
		{'word': '阶级斗争', 'descriptions': ['抓住阶级斗争这个纲，一年大变样', '玉门石油管理局各级革委会认真学习北京六厂二校经验狠抓阶级斗争推动革命竞赛', '以阶级斗争为纲才能迅速发展工业'], 'frequency': [14, 4, 16, 180, 1778, 26, 34, 14, 0, 0, 0]},
		{'word': '粉碎', 'descriptions': ['抗议美帝决定在安奇特卡岛进行核试验  日本各地人民纷纷展开斗争    东京工人和青年集会决心为恢复    日中邦交、粉碎“归还”冲绳协定而斗争', '上海三十一个革命组织发表《紧急通告》革命农民联合起来，粉碎阶级敌人新阴谋抓革命，促生产，夺取革命生产双胜利', '以凌厉的攻势猛袭右派军队粉碎敌人“蚕食”解放区阴谋老挝爱国军民解放战略要地南博川圹等省爱国军民主动出击不断取得新胜利'], 'frequency': [300, 6, 452, 1728, 1642, 134, 72, 62, 70, 12, 5]},
		{'word': '自由', 'descriptions': ['联合国贸发理事会会议结束第一期会议通过决议确认各国享有自由支配本国资源的主权；    并声明各国对其资源实行国有化时，    应付的赔偿数额由本国自行决定', '阿扎尼亚朋友说毛泽东思想是自由战士非常宝贵的财富毛泽东思想影响和威望将永葆青春', '“旱鸭子”取得海上的自由'], 'frequency': [306, 20, 848, 1652, 674, 44, 208, 620, 952, 530, 371]},
		{'word': '安理会', 'descriptions': ['第三世界许多国家代表在安理会会议上发言谴责南非种族主义政权要求把它驱逐出联合国黄华重申我国一贯支持非洲和阿扎尼亚人民斗争的立场肯尼亚等国提出的驱逐南非的决议草案由于美英法投票反对而遭到否决', '非洲国家和其他国家代表在联合国安理会特别会议上    痛斥殖民主义支持非洲民族解放运动    坦桑尼亚、乌干达、中国、南斯拉夫、阿根廷和扎伊尔    代表发了言', '索马里、几内亚、苏丹、中国等国代表在联合国安理会发言谴责以色列侵略叙利亚和黎巴嫩黄华指出中国政府和人民坚决支持巴勒斯坦人民、    阿拉伯各国政府和人民的正义斗争'], 'frequency': [66, 8, 504, 440, 402, 44, 294, 504, 1470, 614, 153]},
		{'word': '政变', 'descriptions': ['越南外交部声明和越《人民报》评论强烈谴责柬政变集团屠杀越南侨民的罪行美帝走狗朗诺—施里玛达集团必须对其暴行的后果负全部责任', '日本毛泽东思想研究会的《人民新闻》谴责美帝策动柬埔寨政变美帝国主义必败！印度支那各国人民必胜！', '右派政变当局多次出动军队妄图镇压柴桢省爱国力量柬埔寨爱国力量打得反动军队狼狈不堪'], 'frequency': [24, 2, 22, 714, 318, 34, 224, 210, 278, 74, 16]},
		{'word': '国家主权', 'descriptions': ['不结盟国家首脑会议筹委会会议开幕布特弗利卡外长发表讲话，强调不结盟运动拒绝任何从属关系和出让任何权利，要用各种手段维护国家主权', '反对海洋霸权主义维护国家主权和安全', '拉美国家重申保卫二百海里涅领海权秘鲁、厄瓜多尔外长阐明对外政策，强调保卫国家主权和自然资源阿根廷、哥伦比亚外长呼吁拉美国家在海洋权问题上协调一致'], 'frequency': [10, 0, 52, 92, 264, 26, 4, 6, 52, 20, 18]},
		{'word': '严重警告', 'descriptions': ['美国军舰和军用飞机侵入我领海领空我提出第四百二十七次严重警告', '美国军舰和飞机侵犯我领海领空我提出第四百六十次严重警告', '美机美舰侵入我领空领海我提出第四百六十九次严重警告'], 'frequency': [12, 0, 24, 818, 224, 2, 4, 8, 6, 4, 3]},
		{'word': '一元化领导', 'descriptions': ['东莞县委坚持党的民主集中制，增强党的团结统一    切实加强党的一元化领导', '通过批评和自我批评实现革委会的一元化领导苏州市红旗区革委会军队代表满腔热情地帮助革委会中其他成员拿起批评和自我批评的武器，用毛泽东思想战胜各种错误思想，逐步实现五个“统一”', '用毛泽东思想加强革委会的思想建设驻安庆市造纸厂的解放军支左人员帮助厂革委会不断克服各种非无产阶级的思想，进一步巩固和加强了革委会的一元化领导'], 'frequency': [6, 0, 0, 0, 224, 0, 2, 0, 0, 0, 0]},
		{'word': '保卫祖国', 'descriptions': ['坦桑尼亚第二副总统卡瓦瓦    号召人民提高警惕保卫祖国    指出殖民主义者在非洲到处受到沉重打击', '赤道几内亚总统发表讲话指出    巴人民正为保卫独立和领土完整而斗争    利比亚驻巴大使重申利比亚全力支持巴人民保卫祖国    阿尔及利亚报纸强调印承认“孟加拉国”严重损害巴主权', '提高警惕保卫祖国  ——在伟大祖国的西沙群岛上'], 'frequency': [4, 2, 214, 350, 220, 20, 18, 28, 4, 0, 2]},
		{'word': '中央', 'descriptions': ['老挝爱国战线党中央和老挝人民解放军最高指挥部举行集会庆祝老挝人民解放军建军二十周年苏发努冯亲王在会上讲话并向一些优秀部队授了勋章', '毛主席关怀胜利回国的反修战士陈毅同志代表毛主席、党中央和国务院，慰问被匈牙利政府无理勒令回国的留学生，赞扬他们在反修斗争中表现了坚定的无产阶级立场。', '伟大领袖毛主席和他的亲密战友林副主席接见在北京的中国人民解放军指战员毛主席神采奕奕，十分高兴地向全场革命战士亲切招手、鼓掌中共中央政治局常委周恩来、陈伯达、康生同志等参加接见'], 'frequency': [878, 446, 7484, 5214, 4484, 822, 1072, 2510, 4962, 5422, 3247]},
		{'word': '选举', 'descriptions': ['罗马尼亚共产党中央委员会举行全体会议决定对党章作某些修改；批准修改宪法建议；建议选举齐奥塞斯库同志为国家总统，马尼亚·曼内斯库同志为部长会议主席', '葡萄牙举行议会选举', '越南全国选举委员会举行首次全体会议'], 'frequency': [284, 18, 1292, 962, 240, 70, 414, 792, 1620, 1374, 541]},
		{'word': '《毛主席语录》', 'descriptions': ['光芒普照的红书——歌颂《毛主席语录》', '只有靠毛泽东思想才能获得日本革命的胜利《毛主席语录》日文版缩印本在日本出版', '澳《先锋报》号召革命者认真学习《毛主席语录》和“老三篇”人人学  天天学  天天用毛泽东思想为被压迫人民所掌握，就是摧毁修正主义和帝国主义的保证'], 'frequency': [0, 0, 0, 0, 234, 0, 0, 0, 0, 0, 0]},
		{'word': '颠覆', 'descriptions': ['苏发努冯亲王等发表联合声明谴责美帝和老挝右派颠覆民族团结政府重申继续为建立和平中立独立民主统一和繁荣的老挝而斗争', '刚果国家元首恩古瓦比谴责美帝的颠覆阴谋号召群众动员起来反对美帝及其走狗刚果《战斗报》痛斥美帝及其走狗的罪恶勾当', '尼雷尔总统呼吁警惕帝国主义对非洲的颠覆阴谋只有人民，才是不可战胜的力量坦桑人民示威支持政府驱逐英国殖民者'], 'frequency': [6, 4, 48, 286, 212, 20, 28, 32, 40, 32, 33]},
		{'word': '诬蔑', 'descriptions': ['朝鲜中央通讯社受权发表声明驳斥朴正熙集团的诬蔑所谓“击沉”朝鲜北方“间谍船”纯属捏造    朴正熙集团制造借口加紧迫害和屠杀南朝鲜爱国青年学生民主人士', '西哈努克亲王在地拉那举行记者招待会    介绍柬人民在抗美救国斗争中取得的巨大胜利，赞扬阿人民对    柬人民的支持，驳斥诬蔑柬王国民族团结政府的谰言', '蒙古族人民不容诬蔑'], 'frequency': [12, 2, 188, 690, 210, 30, 30, 12, 6, 4, 2]},
		{'word': '觉醒', 'descriptions': ['不怕反动派的镇压  不理工贼阻挠破坏  团结战斗坚韧不拔美国工人罢工斗争今年来迅速发展美国工人阶级在激烈的阶级搏斗中加速觉醒，给垄断资本沉重打击', '标志美国工人阶级新觉醒显示坚强不屈战斗精神美国三十七万汽车工人坚持罢工一个月罢工沉重打击了美国垄断资本和美帝扩军备战政策', '意大利人民处在新觉醒中'], 'frequency': [8, 0, 8, 124, 210, 10, 14, 30, 34, 20, 22]},
		{'word': '首都革命', 'descriptions': ['几内亚马里联合访华友好代表团回国国务院副总理陈毅李先念等及首都革命群众到机场热烈欢送', '学习阮文追烈士的革命英雄主义首都革命青年和红卫兵集会纪念阮文追烈士牺牲两周年阮明芳代理团长谴责美帝策划的“七国会议”是侵略会议', '坦桑尼亚、赞比亚代表团离京去南方访问李先念副总理和首都革命群众数千人前往机场热烈欢送'], 'frequency': [2, 2, 4, 0, 220, 0, 0, 0, 0, 0, 0]},
		{'word': '扩军备战', 'descriptions': ['德意日法西斯是如何在战前掩盖扩军备战的', '“自卫队”战斗机撞毁客机使一百六十二人全部遇难    日本人民强烈谴责佐藤政府扩军备战的罪行', '苏美在欧洲扩军备战加剧紧张局势'], 'frequency': [2, 0, 98, 294, 210, 40, 18, 2, 2, 0, 0]},
		{'word': '野心', 'descriptions': ['狂妄的野心    露骨的叫嚷', '亚非记协书记处向周总理祝贺中国核爆炸成功中国核爆炸打击了美帝及其辩护人统治世界野心', '抨击苏美两个超级大国瓜分世界的野心'], 'frequency': [38, 0, 28, 292, 272, 86, 28, 14, 24, 12, 4]},
		{'word': '重创', 'descriptions': ['在磅湛、桔井两省和四号公路战场猛袭敌人    柬民族解放武装力量取得出色战果    重创西贡伪军一个装甲团和两个营，歼大量朗诺伪军', '越南南方军民继续向敌军发起进攻    在承天省歼敌千余  在昆嵩、平隆等省歼灭和重创大量伪军', '在人民大力支援下不断主动出击莫三鼻给游击队重创葡殖民军'], 'frequency': [28, 0, 44, 112, 276, 6, 32, 46, 42, 88, 33]},
		{'word': '内政', 'descriptions': ['阿尔及利亚内政部长接见中国银行代表团', '坚决反对美帝侵犯二百海里领海权保卫民族利益    许多拉美国家进一步联合斗争    拉美各界人士强烈谴责美帝蛮横干涉拉美国家内政', '马里国防、内政和安全部长接见并宴请中国军事友好代表团'], 'frequency': [66, 10, 406, 972, 334, 40, 124, 216, 526, 198, 167]},
		{'word': '基层', 'descriptions': ['把医疗卫生工作的重点放到农村去碧江县人民医院的医务人员到农村去充实基层卫生单位，或到村寨安家落户，走‘赤脚医生’的道路，为各族贫下中农服务', '带着路线斗争的问题坚持开门整风    云梦县委虚心听取群众和基层干部意见，    不断提高路线斗争觉悟', '清丰县基层供销社办生猪繁殖场'], 'frequency': [4, 2, 444, 810, 818, 86, 346, 988, 2522, 2840, 1834]},
		{'word': '斗志昂扬', 'descriptions': ['本溪驻军某团指战员斗志昂扬奔赴农村深入宣传毛主席抓革命促生产方针积极地帮助贫下中农搞好春耕生产', '打破超级大国制造的“不战不和”僵局粉碎以色列军队不可战胜的神话埃叙和巴勒斯坦军民一周战果振奋人心阿拉伯国家出现团结对敌、协同作战、斗志昂扬的新局面', '一手拿镐一手拿枪英姿飒爽斗志昂扬阿妇女战斗在革命和建设的各条战线上不少女干部和女工上山下乡决心在农村长期劳动'], 'frequency': [4, 0, 0, 100, 204, 6, 0, 2, 4, 0, 0]},
		{'word': '纸老虎', 'descriptions': ['痛击纸老虎，打倒新沙皇！全国抗议苏修武装挑衅的怒涛汹涌澎湃排山倒海', '戳穿苏修纸老虎', '北京上海天津广州长沙军民最热烈地欢呼越南南方军民的伟大胜利南越战士们英勇无比  美帝纸老虎原形毕露'], 'frequency': [14, 0, 8, 214, 220, 10, 0, 0, 0, 2, 3]},
		{'word': '武元甲', 'descriptions': ['结束对越南民主共和国的非正式访问柬埔寨国家元首西哈努克亲王到达上海英·萨利特使等同机到达    张春桥主任举行宴会热烈欢迎西哈努克亲王和夫人柬贵宾离河内时，受到孙德胜主席和范文同总理，    武元甲、阮维桢副总理等的欢送', '我驻越使馆举行国庆招待会    长征、范文同、武元甲等党政领导人出席    范文同同志和王幼平大使致词共祝两国人民战斗友谊不断发展', '在范文同总理和武元甲大将等陪同下西哈努克亲王和夫人在河内观看文艺表演宾努亲王和英·萨利特使等也观看了演出'], 'frequency': [0, 0, 124, 166, 194, 16, 2, 0, 8, 0, 0]},
		{'word': '不畏强暴', 'descriptions': ['蔑视当局不准示威的禁令  为争取民主权利而英勇斗争北爱尔兰人民连日进行示威示威群众不畏强暴用啤酒瓶痛击前来镇压的警察', '心红志坚  不畏强暴  斗志昂扬我驻印尼使馆人员英勇斗争大义凛然充分表现了用伟大毛泽东思想武装起来的中国人民的英雄气概', '北爱尔兰群众不畏强暴掀起反迫害斗争示威群众筑起街垒用石块、瓶子和自制汽油弹反击反动军警镇压'], 'frequency': [2, 0, 0, 10, 194, 8, 4, 6, 0, 0, 0]},
		{'word': '中国无产阶级', 'descriptions': ['纳塔奈利大使在庆祝阿尔巴尼亚解放二十三周年招待会上讲话中国无产阶级文化大革命的辉煌成就对世界一切革命都有伟大的历史意义', '阿《人民之声报》元旦发表编辑部文章欢呼世界革命大好形势中国无产阶级文化大革命取得空前辉煌胜利欧洲社会主义明灯阿尔巴尼亚永远向前迈进', '津巴布韦非洲民族联盟来信热烈祝贺我党“九大”中国无产阶级文化大革命取得了辉煌的胜利'], 'frequency': [0, 0, 0, 0, 198, 0, 0, 0, 0, 0, 0]},
		{'word': '《团结报》', 'descriptions': ['阿尔巴尼亚《团结报》揭露美苏加紧核勾结世界人民决不饶恕苏修的叛徒行为', '阿《团结报》、英《工人报》和意《新团结报》发表文章谴责苏美在塞浦路斯问题上进行争夺', '阿尔巴尼亚《团结报》发表社论纪念印度支那人民最高级会议四周年法国各界人士和印度支那三国旅法侨民举行庆祝集会'], 'frequency': [0, 0, 2, 60, 240, 0, 10, 24, 0, 2, 1]},
		{'word': '民族解放运动', 'descriptions': ['苏发努冯亲王电贺越南民主共和国成立二十五周年越南人民的辉煌胜利大大鼓舞世界民族解放运动', '巴勒斯坦民族解放运动代表团访天津', '第三世界国家代表在联大第四委员会辩论罗得西亚问题时发言谴责白人种族主义政权镇压津巴布韦人民我代表揭露一个超级大国鼓吹反动的“缓和”论调破坏民族解放运动'], 'frequency': [12, 4, 46, 166, 302, 8, 4, 8, 0, 6, 0]},
		{'word': '核试验', 'descriptions': ['澳共中央热烈祝贺我国新的核试验成功中国核成就沉重打击了美苏核垄断', '叛徒的嘴脸  帮凶的面目苏联修正主义者公开反对中国核试验', '各国人民继续热烈赞扬我第三次核试验成功中国人民的实力就是各国人民的实力亚非人民能够用毛泽东思想抵御侵略老挝人民解放军最高指挥部代表祝贺中国粉碎了美帝核讹诈阴谋'], 'frequency': [0, 0, 0, 1028, 266, 34, 38, 208, 234, 38, 17]},
		{'word': '反美示威', 'descriptions': ['哥伦比亚各阶层人民举行反美示威', '高呼“越南人民万岁！”“打倒美国侵略者！”南斯拉夫学生再举行反美示威美国奴才铁托集团又实行血腥镇压', '强烈要求把美资公司收归国有厄瓜多尔工人学生举行反美示威'], 'frequency': [0, 0, 0, 324, 188, 0, 4, 2, 8, 6, 0]},
]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>