<template>
	<div class="wordmain" style="overflow:hidden">
		     <el-container style="overflow:hidden">
		        <el-main class="wordcloudmain" style="overflow:hidden">
					<div class="words">
						<words @word-clicked="handleWordClicked" :msg="words2" :clickyear="4"></words>

					</div>
				</el-main>
				
				<el-aside class="wordcloudside" style="overflow:hidden">

				<div class="chart">
					
					<charts :chartData="chartData"></charts>
					
				</div>
				</el-aside>
		      </el-container>
	</div>
</template>

<script>
import words from "../wordcloud/words.vue"
import charts from "../wordcloud/chart.vue"
export default {
  components: {
    words,charts
  },
  data() {
    return {
      chartData: {
		   description:   ['新疆生产部队第二十四农场精简机构降低成本', '罗马尼亚化学工业生产迅速发展一批新的化学企业将陆续投入生产今年的生产将比去年增长四分之一', '羊山大队社员正确处理集体与个人用肥的矛盾好肥料优先满足集体生产需要'],
		   frequency:  [4646, 472, 11856, 17896, 11506, 1186, 4036, 5200, 6552, 2826, 1229],
		   word:'生产',
		   index:3
	   },
      clickedWord: '',
	words2 :[
		{'text': '人民', 'size': 28455},{'text': '生产', 'size': 10980},{'text': '帝国主义', 'size': 6892},{'text': '抗议', 'size': 5046},{'text': '增产', 'size': 3886},{'text': '社会主义', 'size': 3772},{'text': '农业', 'size': 3085},{'text': '周恩来', 'size': 2572},{'text': '合作', 'size': 2302},{'text': '外长', 'size': 2292},{'text': '肯尼迪', 'size': 1817},{'text': '约翰逊', 'size': 1782},{'text': '跃进', 'size': 1666},{'text': '赫鲁晓夫', 'size': 1611},{'text': '恢复', 'size': 1562},{'text': '公社', 'size': 1433},{'text': '人民团体', 'size': 293},{'text': '多快好省', 'size': 284},{'text': '新殖民主义', 'size': 280},{'text': '和平共处', 'size': 276},{'text': '军国主义', 'size': 272},{'text': '水利工程', 'size': 264},{'text': '试验田', 'size': 258},{'text': '殖民统治', 'size': 252},{'text': '合作社', 'size': 140},{'text': '文化交流', 'size': 140},{'text': '土法', 'size': 137},{'text': '修正主义者', 'size': 133},{'text': '国民经济计划', 'size': 126},{'text': '民族解放运动', 'size': 124},{'text': '责任制', 'size': 120},{'text': '民主党派', 'size': 120},{'text': '文化革命', 'size': 110},{'text': '土地改革', 'size': 108},{'text': '自然灾害', 'size': 108},{'text': '中国代表团', 'size': 108},{'text': '农业合作化', 'size': 106},{'text': '民主改革', 'size': 106},{'text': '人民武装', 'size': 106},{'text': '经济发展', 'size': 104},{'text': '内部矛盾', 'size': 104},{'text': '马克思主义', 'size': 102},{'text': '工业化', 'size': 102},{'text': '国民会议', 'size': 102},{'text': '国民党', 'size': 100}
],
      wordData: [
		  {'word': '人民', 'descriptions': ['朝鲜各地数十万人集会声援南部同胞斗争日朝协会理事长说日本和南朝鲜人民必须联合起来共同对敌', '拉萨人民兴高彩烈迎接藏历新年', '全印和平理事会主席森德拉尔和印度一些报纸    欢迎中印两国总理举行会谈    伊拉克“国家报”和以色列“人民呼声报”欢迎周总理的复信'], 'frequency': [7268, 2052, 34316, 44764, 40404, 2770, 3698, 5688, 9080, 8688, 6245]},
		  {'word': '生产', 'descriptions': ['新疆生产部队第二十四农场精简机构降低成本', '罗马尼亚化学工业生产迅速发展一批新的化学企业将陆续投入生产今年的生产将比去年增长四分之一', '羊山大队社员正确处理集体与个人用肥的矛盾好肥料优先满足集体生产需要'], 'frequency': [4646, 472, 11856, 17896, 11506, 1186, 4036, 5200, 6552, 2826, 1229]},
		  {'word': '帝国主义', 'descriptions': ['苏共中央主席团答开罗“晚报”记者苏联永远支持埃及和阿拉伯人民艾森豪威尔主义已暴露帝国主义真面目', '刚果政府军在人民支持下胜利挺进\t帝国主义正加紧策划反对合法政府的新阴谋\t“联合国军”竟开始解除进入路路阿堡的政府军武装', '老挝爱国战线党副主席西吞·库马丹说奔舍那被杀暴露了美帝国主义恶毒面目杀害奔舍那是美帝国主义长期以来谋害老挝爱国爱和平人士、破坏老挝民族团结政府、破坏一九六二年日内瓦协议的阴谋的一部分'], 'frequency': [214, 58, 1310, 7640, 2654, 142, 38, 10, 22, 2, 0]},
		  {'word': '抗议', 'descriptions': ['越人民军联络代表团致函国际委员会抗议美伪企图处决南越爱国青年', '苏联政府照会美国和西德政府  抗议美国用火箭武器武装西德    美国表示武装西德复仇主义者是长期计划的一部分', '佐藤政府倒行逆施  日本人民纷纷反对东京一万名工人集会反对美国核潜艇进驻日本港口民主团体抗议重开“日韩会谈”，妇女请愿反对反动经济政策公众抗议给指挥美国空军用原子弹轰炸广岛和长崎的元凶授勋'], 'frequency': [940, 146, 3402, 5168, 3382, 138, 456, 594, 762, 262, 154]},
		  {'word': '增产', 'descriptions': ['内蒙古增产少数民族日用品', '多加工，多增产', '巴基斯坦棉花大幅度增产'], 'frequency': [434, 36, 2832, 4700, 996, 214, 986, 682, 584, 324, 92]},
		  {'word': '社会主义', 'descriptions': ['赫鲁晓夫在保加利亚大使招待会上说苏联永远要保卫社会主义各国的利益', '罗马尼亚全国农业社联合会成立大会闭幕齐奥塞斯库、斯托伊卡、毛雷尔等出席大会我代表团长致祝词赞扬罗人民的社会主义建设成就', '推动畜牧业社会主义改造新疆牧区发展党的基层组织牧区和半农半牧区已有三分之一的乡有了中共支部'], 'frequency': [166, 44, 1502, 5314, 3506, 490, 628, 990, 2454, 2500, 1296]},
		  {'word': '农业', 'descriptions': ['广东讨论重工业以农业为重要市场问题', '广东江西安徽山东山西等省报纷纷发表社论立即集中力量加强春耕生产领导  争取打好今年农业生产的第一仗', '南国民议会代表团访问京郊高碑店农业社昨晚出席欢迎会并观看京戏“白蛇传”'], 'frequency': [594, 116, 5546, 8704, 4686, 896, 1650, 2376, 6552, 3416, 1837]},
		  {'word': '周恩来', 'descriptions': ['首都三百万人大示威支持苏联反对美国侵略    党和国家领导人周恩来、朱德、林彪、宋庆龄、    邓小平等和苏联大使契尔沃年科出席大会', '周恩来总理和贺龙叶剑英元帅罗瑞卿大将接见击落美军用无人驾驶侦察机有功人员', '哀悼萨波托斯基总统逝世周恩来外长唁电'], 'frequency': [54, 44, 1066, 2596, 3802, 80, 102, 148, 500, 84, 30]},
		  {'word': '合作', 'descriptions': ['日“总评”决定同共产党合作', '匈牙利各地农民春播忙许多解散了的农业合作社在生产中重建起来', '中柬继续举行经济合作会谈'], 'frequency': [1000, 96, 5568, 4140, 2536, 708, 1564, 4238, 9836, 9010, 6576]},
		  {'word': '外长', 'descriptions': ['我国承认阿拉伯也门共和国周总理电贺萨拉勒主席陈外长致电埃尼外长', '为开好非洲首脑会议和亚非会议阿尔及利亚外长等访非洲国家', '越南外长照会日内瓦会议两主席谴责美国加紧扩大侵略南越战争必须采取紧急措施制止美国新军事冒险越南人民军联络代表团抗议美国把更多的军用飞机运进南越'], 'frequency': [330, 80, 1980, 2738, 3070, 696, 1316, 2602, 5236, 3042, 1471]},
		  {'word': '肯尼迪', 'descriptions': ['哈里曼向肯尼迪报告在印阴谋活动叫嚷长期军事援助印度', '池田同肯尼迪会谈策划全面加强日美军事同盟    美国要日本进一步充当侵略亚洲的鹰犬    会谈公报表明日美两国将在亚洲地区加紧军事侵略和经济渗透    池田继续追随美国推行敌视中国制造“两个中国”的反动政策', '罗伯特·肯尼迪承认许多国家和公众不满美国'], 'frequency': [0, 0, 2, 1888, 4, 6, 8, 8, 22, 8, 2]},
		  {'word': '约翰逊', 'descriptions': ['约翰逊政府越失败越疯狂，越疯狂越失败泰勒公然叫嚷要无限扩大侵略越南战争美报哀叹美战争讹诈失败不知往何处去', '约翰逊骗局夭折  华盛顿阵脚大乱国务院召集新闻界调整宣传口径又乞灵于战争讹诈军政头目对扩大战争的前景心中无数更加惶惶不安', '亚非舆论同声谴责约翰逊国情咨文和美国十四点花招约翰逊休想诱使南越人民放下武器美国必须做的一点是从南越滚出去'], 'frequency': [2, 0, 94, 1808, 418, 0, 0, 68, 100, 26, 12]},
		  {'word': '跃进', 'descriptions': ['民间运输业也应当来个大跃进', '鼓起干劲促进生产大跃进', '推广丰产经验实现渔业跃进'], 'frequency': [8, 2, 16, 2676, 148, 80, 6, 10, 18, 20, 3]},
		  {'word': '赫鲁晓夫', 'descriptions': ['赫鲁晓夫同卡斯特罗会谈', '约翰逊揭开又一核骗局  同苏密商后宣布将削减核武器裂变物质生产欢迎赫鲁晓夫采取同一行动说这是“前进了一步”', '赫鲁晓夫答美记者小赫斯特问希望改善苏美关系进行和平竞赛坚信社会主义制度一定获得胜利'], 'frequency': [0, 0, 372, 1720, 552, 4, 2, 6, 0, 0, 0]},
		  {'word': '恢复', 'descriptions': ['辽宁南部五县遭受雹灾各县领导干部到灾区帮助恢复生产', '湘江资江洪水回落  群众努力恢复生产', '浅沼稻次郎在记者招待会上说日本社会党人将掀起恢复日中邦交运动'], 'frequency': [750, 90, 1442, 1672, 900, 234, 832, 1150, 2576, 1546, 644]},
		  {'word': '公社', 'descriptions': ['公社力量大，瑶山日日新', '人民公社光芒万丈', '小岛巨变    记广东阳江县海陵人民公社的各业大发展'], 'frequency': [2, 0, 4, 5618, 2462, 198, 738, 332, 28, 6, 2]},
		  {'word': '人民团体', 'descriptions': ['我国各人民团体热烈祝贺朝鲜人民的光辉节日中朝人民在革命红旗指引下永远团结在一起朝鲜人民在反帝斗争中的英雄气概和在社会主义建设中的雄心壮志大大鼓舞了中国人民', '非洲独立党电贺我国建国十一周年    我国各人民团体继续收到许多来自国外的贺电', '坚决回击亲美独裁政权的疯狂镇压委内瑞拉人民反抗暴政斗争日益炽烈拉丁美洲各国在古侨民组织和古巴人民团体声援委内瑞拉兄弟'], 'frequency': [60, 14, 288, 396, 22, 0, 0, 4, 2, 8, 3]},
		  {'word': '多快好省', 'descriptions': ['一定要做到多快好省化工部加速建设肥料厂', '苏联住宅建设多快好省', '把全国先进经验集中配套为全国矿山建设树立榜样京西矿多快好省开拓岩石巷道冶金煤炭等七系统参加现场会议，全国矿山工作者把经验带回各地'], 'frequency': [0, 0, 2, 288, 356, 16, 8, 6, 4, 0, 0]},
		  {'word': '新殖民主义', 'descriptions': ['西巴伊在第四届亚非人民团结大会上作报告亚非人民对美帝侵略越南不能袖手旁观全力支持刚果人民反对新殖民主义的武装解放斗争', '为新殖民主义服务的“不发达经济学”', '首都集会欢迎阿尔及利亚的英勇战士刘长胜赞扬阿尔及利亚人民反帝斗争的伟大胜利对非洲民族解放运动的深远影响贾米拉和弗吉斯热情歌颂中阿两国人民战斗友谊并表示要粉碎新殖民主义的阴谋'], 'frequency': [0, 0, 0, 310, 108, 36, 2, 0, 0, 2, 4]},
		  {'word': '和平共处', 'descriptions': ['热烈祝贺中缅友好合作的胜利，祝贺和平共处五项原则的胜利    周总理盛宴欢迎缅甸贵宾', '杜尔呼吁民主力量联合起来    粉碎帝国主义对刚果的干涉    指出和平共处应当意味着结束帝国主义和殖民主义', '“不发达世界学生讨论会”响彻反帝最强音坚决进行反帝斗争取得民族解放主张通过一切斗争方式反对帝国主义——强调不发达国家必须重视武装革命——指出被压迫国家同压迫国家不能和平共处'], 'frequency': [0, 0, 130, 384, 18, 0, 4, 42, 64, 44, 16]},
		  {'word': '军国主义', 'descriptions': ['哥穆尔卡发表演说支持苏联裁军倡议    要求西方国家效法苏联裁减军队    斥西德军国主义者企图使世界陷入战争深渊', '进一步复活日本军国主义并准备向海外派兵佐藤政府加紧制定新扩军计划日本垄断资本为侵越美军供应大量军用物资', '蒙古外交部就岸信介赴美签订军事条约发表声明    日美军事联盟加剧亚洲紧张局势    蒙古人民对日本军国主义复活感到极大的愤慨'], 'frequency': [30, 4, 286, 468, 666, 2, 66, 8, 22, 4, 15]},
		  {'word': '水利工程', 'descriptions': ['保证春耕用水赶上春汛防洪    广东浙江安徽湖南等省冬春水利工程超额完成计划', '调查情况  统筹安排  分别先后  注意质量    江西农田水利工程维修配套    今冬明春沿江滨湖地区将建立一批抽水机站', '书本知识变活了记清华大学水利工程系一批毕业生的毕业设计答辩'], 'frequency': [10, 0, 146, 296, 94, 24, 42, 44, 120, 26, 39]},
		  {'word': '试验田', 'descriptions': ['蒋牧良种“试验田”', '广东农村干部全种试验田', '试验田及其他'], 'frequency': [0, 0, 2, 262, 22, 6, 6, 8, 32, 30, 52]},
		  {'word': '殖民统治', 'descriptions': ['津巴布韦民族主义政党领导人声明  将以武装斗争反对殖民统治', '阿根廷一周刊揭露“争取进步联盟”的欺骗性美“援”是殖民统治的新方式帝国主义资本没有好坏之别，它总是追求最大限度的剥削', '一百三十多年的斗争  阿尔及利亚人民反抗法国殖民统治的一些史实'], 'frequency': [0, 0, 50, 264, 100, 2, 4, 0, 20, 0, 1]},
		  {'word': '合作社', 'descriptions': ['供销合作社提出今年任务集中主要力量作好农产品采购工作，努力收购小土产品和废品，做好农村物资供应工作，更好地安排市场', '罗马尼亚消费合作社举行代表大会', '合作社对谁“不自由”？谁占了谁的便宜？'], 'frequency': [540, 44, 3116, 520, 94, 6, 36, 126, 134, 244, 124]},
		  {'word': '文化交流', 'descriptions': ['加强中日人民文化交流和友谊我对外文协和日中文化交流协会在京签订共同声明', '加强中阿人民的文化交流阿联电影周在首都开幕', '日中文化交流协会欢宴我文化代表团'], 'frequency': [0, 4, 142, 188, 140, 14, 72, 152, 232, 272, 254]},
		  {'word': '土法', 'descriptions': ['土法上马比洋法上马好', '先用土法跨上马  逐步实现机械化', '洋法土法大造纸张'], 'frequency': [4, 0, 0, 164, 38, 2, 2, 6, 32, 18, 1]},
		  {'word': '修正主义者', 'descriptions': ['最强烈谴责约翰逊政府镇压黑人的法西斯暴行艾地主席号召声援美国黑人斗争揭露现代修正主义者充当美帝国主义忠实帮手', '桑穆加塔桑在锡兰公众庆祝我国庆节集会上讲话驳斥帝国主义和修正主义者对中国的诬蔑阿尔及利亚一画报说中国是世界民族解放运动的忠实朋友', '联合国在美帝操纵下干尽坏事美国同修正主义者的吹捧掩盖不了联合国罪行'], 'frequency': [0, 0, 0, 406, 126, 2, 0, 0, 0, 0, 0]},
		  {'word': '国民经济计划', 'descriptions': ['波兰公布去年国民经济计划执行情况公报工业总产值超额完成计划年产钢五百万吨和煤近亿吨', '库兹明报告发展国民经济计划苏联明年工业将增产百分之七点六钢产量达五千三百六十万吨煤增产二千七百万吨', '关于１９５６年度国民经济计划的执行结果和１９５７年度国民经济计划草案的报告１９５７年７月１日在第一届全国人民代表大会第四次会议上'], 'frequency': [6, 2, 44, 126, 2, 2, 32, 10, 2, 0, 0]},
		  {'word': '民族解放运动', 'descriptions': ['当代非洲民族解放运动的伟大事件——祝贺阿尔及利亚独立', '越南报纸继续揭露美英苏条约的大骗局美国利用三国条约加强核力量镇压民族解放运动', '谴责英国野蛮镇压中非民族解放运动'], 'frequency': [12, 4, 46, 166, 302, 8, 4, 8, 0, 6, 0]},
		  {'word': '责任制', 'descriptions': ['加强思想教育  改进评工制度    中村大队提高农活质量    将口公社作培第二生产队健全责任制度细管稻田', '自己动手制造备品配件  发动群众健全责任制度    邯郸采矿公司设备检修好矿石产量高', '包乘制是一项有效的责任制度'], 'frequency': [0, 0, 196, 210, 6, 12, 638, 562, 330, 108, 54]},
		  {'word': '民主党派', 'descriptions': ['在政协第二届全国委员会第三次全体会议上的发言解除顾虑勇于辩论知无不言言无不尽陆侃如发言：希望学术界和民主党派能够本着这种精神贯彻“百花齐放，百家争鸣”“长期共存，互相监督”的方针', '人民团体民主党派负责人发表谈话欢呼空军英勇歼敌战无不胜警告美帝猖狂挑衅必遭失败', '各民主党派、无党派民主人士和全国工商联    庆祝中国共产党成立四十周年的献词'], 'frequency': [88, 18, 384, 318, 12, 2, 50, 122, 186, 94, 28]},
		  {'word': '文化革命', 'descriptions': ['甘肃省在文化革命声中创办两种文艺刊物', '高举文化革命红旗向工农群众知识化迈进', '河北省文化革命的高潮'], 'frequency': [2, 0, 4, 116, 172, 0, 2, 0, 2, 0, 0]},
		  {'word': '土地改革', 'descriptions': ['打倒美帝国主义要求土地改革秘鲁首都十万群众举行反帝集会哥伦比亚文化界人士集会谴责美国的文化侵略活动', '团结起来为粉碎帝国主义和封建势力的枷锁而斗争\t拉丁美洲种植园工人举行代表会议\t各国代表强烈谴责第一号大庄园主美帝国主义，\t要求实行彻底的土地改革，支持古巴革命', '要求实行真正的土地改革  反对封建剥削和苛捐杂税    印度各地农民举行集会示威'], 'frequency': [496, 20, 498, 118, 0, 0, 2, 8, 6, 10, 2]},
		  {'word': '自然灾害', 'descriptions': ['充分发挥人的主观能动作用  从最坏处着想向最好处努力    三道防线争主动  战胜干旱多打粮    宜良县总结战胜自然灾害经验，乘胜前进，狠抓小春生产', '发动群众总结今年丰收经验提高信心鼓舞干劲镇江专区挖掘潜力争取明年再增产各地在讨论中并制定了防御自然灾害的具体措施', '依靠集体力量依靠国家支援战胜自然灾害阿尔巴尼亚农业在灾年争得好收成'], 'frequency': [0, 0, 48, 108, 132, 8, 2, 12, 48, 96, 56]},
		  {'word': '中国代表团', 'descriptions': ['中国和其它外国代表慰问日本和平战士菊地升日本文化界人士宴请中国代表团', '中美记者入境采访要平等互惠中国代表团在中美会谈后举行记者招待会', '彭真副委员长接见出席广岛世界大会后访华的外国朋友和中国代表团'], 'frequency': [6, 6, 38, 142, 126, 6, 24, 56, 194, 162, 58]},
		  {'word': '农业合作化', 'descriptions': ['匈牙利农业合作化运动的发展', '德国农业合作化运动发展迅速    全国十四个专区中已有十三个专区全部合作化', '匈牙利国民议会会议闭幕    卡达尔和卡拉伊谈各国共产党和工人党代表会议成就    会议支持政府外交政策决定继续发展农业合作化运动'], 'frequency': [0, 0, 288, 180, 10, 0, 0, 0, 0, 0, 0]},
		  {'word': '民主改革', 'descriptions': ['越南北方山区一半地区完成民主改革    波兰汽车工业飞速发展  年产将达三万五千辆', '大力防治畜疫  加强饲养管理西藏今年纯增牲畜九十万头全区藏族专职兽医技术人员比民主改革前增加了七倍危害畜牧业最大的牛瘟、炭疽等疫病，已基本得到控制', '拉萨市长顿珠才仁畅谈平叛和民主改革后的巨大变化拉萨人民满怀革命热情建设新生活'], 'frequency': [2, 0, 108, 124, 8, 0, 0, 8, 20, 48, 8]},
		  {'word': '人民武装', 'descriptions': ['美国侵略者在南越损失续增两天内即损失飞机四架死亡达二十三人人民武装打死美军官一人伪军二十二人', '葡属黑非洲学联代表大会坚持反帝斗争强调通过武装斗争消灭殖民统治谢邦定热烈赞扬安哥拉等国人民武装斗争和赢得的胜利大会拒绝了苏联代表伙同德代表为三国条约吹捧的动议', '南越平定省人民武装粉碎美伪“扫荡”取得辉煌战果蓬山大捷歼美军近两千击落击毁美机八十九架解放武装力量炮轰岘港和诺曼美机基地击毁美机三十四架'], 'frequency': [146, 6, 154, 1002, 2210, 34, 12, 16, 10, 8, 4]},
		  {'word': '经济发展', 'descriptions': ['苏联经济学界关于经济发展速度问题的几种看法', '南斯拉夫的经济发展', '林粮间作加速山区经济发展    湖南省桂阳县门楼下人民公社林粮间作调查'], 'frequency': [8, 6, 50, 166, 66, 18, 106, 564, 1704, 1322, 675]},
		  {'word': '内部矛盾', 'descriptions': ['上海老工人座谈当前人民内部矛盾反对撤出公方代表和定息二十年', '毛主席《关于正确处理人民内部矛盾的问题》一书古巴再次发行十万册', '人的思想革命化的重大意义——重读《关于正确处理人民内部矛盾的问题》'], 'frequency': [6, 0, 28, 206, 82, 0, 6, 8, 28, 24, 2]},
		  {'word': '马克思主义', 'descriptions': ['学习辩证法  坚持科学性\t——读“马克思主义经典作家论历史科学”', '洛滨太不自量妄想取消马克思主义', '调查研究是马克思主义的根本方法'], 'frequency': [2, 2, 46, 126, 382, 52, 94, 212, 606, 816, 427]},
		  {'word': '工业化', 'descriptions': ['苏联专家以高度的国际主义精神和精湛的技术帮助我国初步打下工业化的基础', '满足国家工业化和出口的需要越南积极发展各种经济作物改进和加强技术措施已使经济作物单位面积产量显著提高', '社会主义工业化的重要进展包钢建厂工程正式动工'], 'frequency': [10, 2, 200, 106, 22, 2, 12, 22, 82, 236, 90]},
		  {'word': '国民会议', 'descriptions': ['大力促进中日邦交早日正常化中国人民外交学会和日本恢复日中邦交国民会议访华使节团签订共同声明', '日本“国民会议”全力准备总罢工    社会党议员分赴全国各地动员群众参加斗争', '进一步开展反对“日韩会谈”的群众斗争日本“国民会议”决定加强统一行动第六次统一行动将有数百万人举行大游行'], 'frequency': [0, 0, 26, 138, 32, 2, 0, 0, 12, 22, 6]},
		  {'word': '国民党', 'descriptions': ['向我勐腊驻军投诚的国民党士兵    揭露美国利用国民党残匪扩大老挝内战', '昂季准将在记者招待会上指出    侵缅蒋机使用了东南亚集团基地    缅军占领国民党残匪在缅的一个基地', '菲律宾国民党总统候选人现任总统加西亚当选'], 'frequency': [644, 112, 380, 144, 24, 2, 54, 238, 140, 270, 72]},

]
    };
  },
  methods: {
    handleWordClicked(word) {
      this.clickedWord = word;
      console.log(word);
      
      // 查找匹配的词对应的描述
      const foundWord = this.wordData.find(item => item.word === this.clickedWord);
      if (foundWord) {
        console.log(foundWord.frequency);
	     this.chartData.description=foundWord.descriptions;
		 this.chartData.frequency=foundWord.frequency;
		 this.chartData.word=foundWord.word;
      } else {
        console.log('未找到匹配的词描述');
      }
    },
  },
};
</script>

<style>
.wordmain{
	margin-left:-5vw;
}
.wordcloudmain{
	width:40vw;
	margin-top: -15vh;
}
.wordcloudside{
	width:30vw;
}
.words{
    width: 40vw;
    height: 90vh;
	margin-top: -10vh;
}
.chart{
  width: 25vw;
  height: auto;
    
}

</style>